lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
typedef struct {
  uint32_t count;
  uint32_t step;
  uint32_t heartbeat;
  uint32_t sequence;
  uint8_t flags;
} vpr_ticker_event_entry_t;

typedef struct {
  uint32_t eventCount;
  uint32_t heartbeat;
  uint32_t randomDelayTicks;
  uint32_t sequence;
  uint8_t flags;
  uint8_t channelMask;
} vpr_ble_legacy_adv_event_entry_t;

typedef struct {
  uint32_t eventCount;
  uint32_t disconnectCount;
  uint32_t sequence;
  uint16_t connHandle;
  uint16_t intervalUnits;
  uint16_t latency;
  uint16_t supervisionTimeout;
  uint8_t flags;
  uint8_t reason;
  uint8_t role;
  uint8_t encrypted;
  uint8_t txPhy;
  uint8_t rxPhy;
} vpr_ble_connection_event_entry_t;

#if !VPR_CS_DEDICATED_IMAGE
static uint32_t g_ticker_enabled = 0U;
static uint32_t g_ticker_period_ticks = 0U;
static uint32_t g_ticker_step = 1U;
static uint32_t g_ticker_accum = 0U;
static uint32_t g_ticker_count = 0U;
static uint32_t g_ticker_event_enabled = 0U;
static uint32_t g_ticker_event_emit_every = 0U;
static uint32_t g_ticker_event_last_emitted_count = 0U;
static uint32_t g_ticker_event_sequence = 0U;
static uint32_t g_ticker_event_drop_count = 0U;
static vpr_ticker_event_entry_t g_ticker_event_queue[VPR_TICKER_EVENT_QUEUE_DEPTH];
static uint32_t g_ticker_event_queue_head = 0U;
static uint32_t g_ticker_event_queue_tail = 0U;
static uint32_t g_ticker_event_queue_count = 0U;
static uint32_t g_ble_legacy_adv_enabled = 0U;
static uint32_t g_ble_legacy_adv_interval_ticks = 0U;
static uint32_t g_ble_legacy_adv_event_count = 0U;
static uint32_t g_ble_legacy_adv_next_heartbeat = 0U;
static uint32_t g_ble_legacy_adv_last_random_delay_ticks = 0U;
static uint32_t g_ble_legacy_adv_event_sequence = 0U;
static uint32_t g_ble_legacy_adv_event_drop_count = 0U;
static uint8_t g_ble_legacy_adv_channel_mask = 0x07U;
static uint8_t g_ble_legacy_adv_last_channel_mask = 0U;
static uint8_t g_ble_legacy_adv_next_channel_index = 0U;
static uint8_t g_ble_legacy_adv_add_random_delay = 0U;
static uint8_t g_ble_legacy_adv_data_len = 0U;
static uint8_t g_ble_legacy_adv_data[31];
static vpr_ble_legacy_adv_event_entry_t
    g_ble_legacy_adv_event_queue[VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH];
static uint32_t g_ble_legacy_adv_event_queue_head = 0U;
static uint32_t g_ble_legacy_adv_event_queue_tail = 0U;
static uint32_t g_ble_legacy_adv_event_queue_count = 0U;
static uint32_t g_ble_connection_connected = 0U;
static uint32_t g_ble_connection_event_count = 0U;
static uint32_t g_ble_connection_disconnect_count = 0U;
static uint32_t g_ble_connection_event_sequence = 0U;
static uint32_t g_ble_connection_event_drop_count = 0U;
static uint16_t g_ble_connection_conn_handle = 0U;
static uint16_t g_ble_connection_interval_units = 0U;
static uint16_t g_ble_connection_latency = 0U;
static uint16_t g_ble_connection_supervision_timeout = 0U;
static uint8_t g_ble_connection_role = 0U;
static uint8_t g_ble_connection_encrypted = 0U;
static uint8_t g_ble_connection_tx_phy = 0U;
static uint8_t g_ble_connection_rx_phy = 0U;
static uint8_t g_ble_connection_last_event_flags = 0U;
static uint8_t g_ble_connection_last_disconnect_reason = 0U;
static uint8_t g_ble_cs_link_bound = 0U;
static uint8_t g_ble_cs_workflow_defaults_applied = 0U;
static uint8_t g_ble_cs_workflow_config_created = 0U;
static uint8_t g_ble_cs_workflow_security_enabled = 0U;
static uint8_t g_ble_cs_workflow_params_applied = 0U;
static uint8_t g_ble_cs_workflow_procedure_enabled = 0U;
static uint8_t g_ble_cs_workflow_config_id = 0U;
static uint8_t g_ble_cs_workflow_max_procedure_count = 0U;
static uint8_t g_ble_cs_workflow_running = 0U;
static uint8_t g_ble_cs_workflow_completed = 0U;
static uint8_t g_ble_cs_workflow_completed_procedure_count = 0U;
static uint8_t g_ble_cs_workflow_completed_config_id = 0U;
static uint8_t g_ble_cs_workflow_completed_local_subevent_count = 0U;
static uint8_t g_ble_cs_workflow_completed_peer_subevent_count = 0U;
static uint8_t g_ble_cs_workflow_completed_local_step_count = 0U;
static uint8_t g_ble_cs_workflow_completed_peer_step_count = 0U;
static uint8_t g_ble_cs_workflow_completed_local_mode1_count = 0U;
static uint8_t g_ble_cs_workflow_completed_peer_mode1_count = 0U;
static uint8_t g_ble_cs_workflow_completed_local_mode2_count = 0U;
static uint8_t g_ble_cs_workflow_completed_peer_mode2_count = 0U;
static uint16_t g_ble_cs_workflow_nominal_distance_q4 = 0U;
static uint32_t g_ble_cs_workflow_completed_demo_channels_packed = 0U;
static uint32_t g_ble_cs_workflow_completed_local_hash32 = 0U;
static uint32_t g_ble_cs_workflow_completed_peer_hash32 = 0U;
static uint16_t g_ble_cs_workflow_completed_local_payload_len = 0U;
static uint16_t g_ble_cs_workflow_completed_peer_payload_len = 0U;
static uint8_t g_ble_cs_workflow_completed_local_payload[VPR_BLE_CS_COMPLETED_RESULT_MAX_LEN];
static uint8_t g_ble_cs_workflow_completed_peer_payload[VPR_BLE_CS_COMPLETED_RESULT_MAX_LEN];
static uint32_t g_ble_cs_workflow_runtime_event_count = 0U;
static uint32_t g_ble_cs_workflow_next_heartbeat = 0U;
static vpr_ble_connection_event_entry_t
    g_ble_connection_event_queue[VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH];
static uint32_t g_ble_connection_event_queue_head = 0U;
static uint32_t g_ble_connection_event_queue_tail = 0U;
static uint32_t g_ble_connection_event_queue_count = 0U;
#endif
static uint8_t g_pending_cs_result_stage = 0U;
#if VPR_CS_DEDICATED_IMAGE
static uint8_t g_measurement_execute_result_active = 0U;
static uint8_t g_cs_result_publish_debug_reason = 0U;
static uint8_t g_cs_result_publish_debug_stage = 0U;
static void clear_timed_mode2_result_observations(void);
#endif
static uint8_t g_cs_test_active = 0U;
#if VPR_CS_DEDICATED_IMAGE
/* Standalone CS Test result stream (LE CS Test Start/End): emits 0x31/0x32 on
 * BLE_CS_HCI_TEST_CONN_HANDLE while g_cs_test_active != 0.  Mutually exclusive
 * with the connected-session result staging (g_pending_cs_result_stage). */
static uint8_t g_pending_cs_test_result_stage = 0U;
static uint16_t g_cs_test_procedure_counter = 0U;
static uint32_t g_cs_test_next_stage_heartbeat = 0U;
#endif
#if VPR_CS_DEDICATED_IMAGE
static uint32_t g_cs_next_procedure_heartbeat = 0U;
static uint32_t g_cs_next_subevent_heartbeat = 0U;
static uint32_t g_cs_next_peer_stage_heartbeat = 0U;
static uint32_t g_cs_next_chunk_stage_heartbeat = 0U;
static uint8_t g_cs_last_peer_gap_ticks = 0U;
static uint8_t g_cs_last_interval_selector = 0U;
static uint8_t g_cs_active_subevent_index = 0U;
static uint8_t g_cs_local_chunk_start_step = 0U;
static uint8_t g_cs_peer_chunk_start_step = 0U;
static uint32_t g_cs_measurement_execute_count = 0U;
static uint8_t g_cs_measurement_execute_last_status = 0xFFU;
static uint8_t g_cs_measurement_execute_last_channels = 0U;
static uint32_t g_cs_measurement_execute_last_token = 0U;
typedef struct __attribute__((packed)) {
  uint8_t configId;
  uint16_t procedureCounter;
  uint16_t sessionConnHandle;
  uint32_t demoChannelsPacked;
  uint8_t mainModeType;
  uint8_t subModeType;
  uint8_t minMainModeSteps;
  uint8_t maxMainModeSteps;
  uint8_t mainModeRepetition;
  uint8_t mode0Steps;
  uint8_t role;
  uint8_t rttType;
  uint8_t csSyncPhy;
  uint8_t channelMap[10];
  uint8_t channelMapRepetition;
  uint8_t channelSelectionType;
  uint8_t ch3cShape;
  uint8_t ch3cJump;
  uint8_t enhancements1;
  int8_t maxTxPowerDbm;
  uint16_t maxProcedureLen;
  uint16_t minProcedureInterval;
  uint16_t maxProcedureInterval;
  uint16_t maxProcedureCount;
  uint32_t minSubeventLen;
  uint32_t maxSubeventLen;
  uint8_t toneAntennaConfigSelection;
  uint8_t phy;
  int8_t txPowerDelta;
  uint8_t configCreated;
  uint8_t securityEnabled;
  uint8_t procedureParamsApplied;
  uint8_t procedureEnabled;
  uint8_t sessionOpen;
  uint8_t lastEvictedConfigId;
} vpr_cs_dedicated_state_t;

