lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static uint32_t current_ble_cs_workflow_stage_ticks(void) {
  uint32_t ticks = (uint32_t)g_ble_connection_interval_units;
  if (ticks < 16U) {
    ticks = 16U;
  }
  if (ticks > 128U) {
    ticks = 128U;
  }
  return ticks;
}

static void reset_ble_cs_workflow_runtime_state(bool clear_summary) {
  g_ble_cs_workflow_running = 0U;
  g_ble_cs_workflow_next_heartbeat = 0U;
  if (clear_summary) {
    g_ble_cs_workflow_completed = 0U;
    g_ble_cs_workflow_completed_procedure_count = 0U;
    g_ble_cs_workflow_completed_config_id = 0U;
    g_ble_cs_workflow_completed_local_subevent_count = 0U;
    g_ble_cs_workflow_completed_peer_subevent_count = 0U;
    g_ble_cs_workflow_completed_local_step_count = 0U;
    g_ble_cs_workflow_completed_peer_step_count = 0U;
    g_ble_cs_workflow_completed_local_mode1_count = 0U;
    g_ble_cs_workflow_completed_peer_mode1_count = 0U;
    g_ble_cs_workflow_completed_local_mode2_count = 0U;
    g_ble_cs_workflow_completed_peer_mode2_count = 0U;
    g_ble_cs_workflow_nominal_distance_q4 = 0U;
    g_ble_cs_workflow_completed_demo_channels_packed = 0U;
    g_ble_cs_workflow_completed_local_hash32 = 0U;
    g_ble_cs_workflow_completed_peer_hash32 = 0U;
    g_ble_cs_workflow_completed_local_payload_len = 0U;
    g_ble_cs_workflow_completed_peer_payload_len = 0U;
    bytes_zero(g_ble_cs_workflow_completed_local_payload,
               sizeof(g_ble_cs_workflow_completed_local_payload));
    bytes_zero(g_ble_cs_workflow_completed_peer_payload,
               sizeof(g_ble_cs_workflow_completed_peer_payload));
    g_ble_cs_workflow_runtime_event_count = 0U;
  }
}

static void maybe_start_ble_cs_workflow_runtime(void) {
  reset_ble_cs_workflow_runtime_state(true);
  if (g_ble_cs_workflow_procedure_enabled == 0U || ble_cs_link_runnable() == 0U ||
      ble_cs_workflow_configured() == 0U || g_ble_cs_workflow_max_procedure_count == 0U) {
    return;
  }
  g_ble_cs_workflow_running = 1U;
  g_ble_cs_workflow_next_heartbeat =
      g_vpr_transport->heartbeat + current_ble_cs_workflow_stage_ticks();
}

static void service_ble_cs_workflow_runtime(void) {
  if (g_ble_cs_workflow_running == 0U) {
    return;
  }
  if (g_ble_cs_workflow_procedure_enabled == 0U || ble_cs_link_runnable() == 0U ||
      ble_cs_workflow_configured() == 0U || g_ble_cs_workflow_max_procedure_count == 0U) {
    reset_ble_cs_workflow_runtime_state(true);
    return;
  }
  if (g_vpr_transport->heartbeat < g_ble_cs_workflow_next_heartbeat) {
    return;
  }

  g_ble_cs_workflow_completed_procedure_count =
      (uint8_t)(g_ble_cs_workflow_completed_procedure_count + 1U);
  g_ble_cs_workflow_runtime_event_count =
      g_ble_cs_workflow_runtime_event_count + 1U;

  if (g_ble_cs_workflow_completed_procedure_count >= g_ble_cs_workflow_max_procedure_count) {
    const uint8_t local_mode1_count = current_ble_cs_workflow_completed_mode1_count();
    const uint8_t peer_mode1_count = current_ble_cs_workflow_completed_mode1_count();
    const uint8_t local_mode2_count = current_ble_cs_workflow_completed_mode2_count();
    const uint8_t peer_mode2_count = current_ble_cs_workflow_completed_mode2_count();
    g_ble_cs_workflow_running = 0U;
    g_ble_cs_workflow_completed = 1U;
    g_ble_cs_workflow_completed_config_id = g_ble_cs_workflow_config_id;
    g_ble_cs_workflow_completed_local_subevent_count =
        current_ble_cs_workflow_completed_local_subevent_count();
    g_ble_cs_workflow_completed_peer_subevent_count =
        current_ble_cs_workflow_completed_peer_subevent_count();
    g_ble_cs_workflow_completed_local_mode1_count = local_mode1_count;
    g_ble_cs_workflow_completed_peer_mode1_count = peer_mode1_count;
    g_ble_cs_workflow_completed_local_mode2_count = local_mode2_count;
    g_ble_cs_workflow_completed_peer_mode2_count = peer_mode2_count;
    g_ble_cs_workflow_completed_local_step_count =
        (uint8_t)(local_mode1_count + local_mode2_count);
    g_ble_cs_workflow_completed_peer_step_count =
        (uint8_t)(peer_mode1_count + peer_mode2_count);
    g_ble_cs_workflow_completed_demo_channels_packed =
        current_ble_cs_workflow_completed_demo_channels_packed();
    cache_ble_cs_workflow_completed_results();
    if (g_ble_cs_workflow_completed_local_payload_len == 0U ||
        g_ble_cs_workflow_completed_peer_payload_len == 0U) {
      g_ble_cs_workflow_completed_local_hash32 =
          current_ble_cs_workflow_completed_result_hash32(0x4CU);
      g_ble_cs_workflow_completed_peer_hash32 =
          current_ble_cs_workflow_completed_result_hash32(0x50U);
    }
    g_ble_cs_workflow_nominal_distance_q4 =
        current_ble_cs_workflow_nominal_distance_q4();
    g_ble_cs_workflow_next_heartbeat = 0U;
  } else {
    g_ble_cs_workflow_next_heartbeat =
        g_vpr_transport->heartbeat + current_ble_cs_workflow_stage_ticks();
  }
}

static uint32_t current_ble_connection_state_packed(uint32_t host_flags) {
  uint32_t packed = 0U;
  if ((host_flags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) {
    packed |= NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  }
  if (g_restored_from_hibernate != 0U) {
    packed |= 0x00000002UL;
  }
  if (g_ble_connection_connected != 0U) {
    packed |= 0x00000004UL;
  }
  if (g_ble_connection_encrypted != 0U) {
    packed |= 0x00000008UL;
  }
  if (g_ble_cs_link_bound != 0U) {
    packed |= 0x00000010UL;
  }
  if (ble_cs_link_runnable() != 0U) {
    packed |= 0x00000020UL;
  }
  if (ble_cs_workflow_configured() != 0U) {
    packed |= 0x00000040UL;
  }
  if (g_ble_cs_workflow_procedure_enabled != 0U) {
    packed |= 0x00000080UL;
  }
  packed |= ((uint32_t)g_ble_connection_role & 0xFFU) << 8U;
  packed |= ((uint32_t)g_ble_connection_conn_handle & 0xFFFFU) << 16U;
  return packed;
}

static uint32_t current_ble_connection_state_aux_packed(void) {
  return ((uint32_t)g_ble_connection_interval_units & 0xFFFFU) |
         (((uint32_t)g_ble_connection_latency & 0xFFFFU) << 16U);
}

static uint32_t current_ble_connection_state_meta_packed(void) {
  return ((uint32_t)g_ble_connection_supervision_timeout & 0xFFFFU) |
         (((uint32_t)g_ble_connection_tx_phy & 0xFFU) << 16U) |
         (((uint32_t)g_ble_connection_rx_phy & 0xFFU) << 24U);
}

static uint32_t current_ble_connection_state_config_packed(void) {
  return ((uint32_t)g_ble_connection_last_event_flags & 0xFFU) |
         (((uint32_t)g_ble_connection_last_disconnect_reason & 0xFFU) << 8U) |
         (((uint32_t)g_ble_connection_event_count & 0xFFFFU) << 16U);
}

static void clear_retained_hibernate_state(void) {
  g_host_transport->hibernateCookie = 0U;
  g_host_transport->hibernateFlags = 0U;
  g_host_transport->retainedTickerPeriodTicks = 0U;
  g_host_transport->retainedTickerStep = 0U;
  g_host_transport->retainedTickerAccum = 0U;
  g_host_transport->retainedTickerCount = 0U;
}

static void persist_hibernate_state(void) {
  uint32_t flags = NRF54L15_VPR_TRANSPORT_HIBERNATE_FLAG_TICKER_VALID;
  if (g_ticker_enabled != 0U) {
    flags |= NRF54L15_VPR_TRANSPORT_HIBERNATE_FLAG_TICKER_ENABLED;
  }
  g_host_transport->hibernateCookie = NRF54L15_VPR_TRANSPORT_HIBERNATE_COOKIE;
  g_host_transport->hibernateFlags = flags;
  g_host_transport->retainedTickerPeriodTicks = g_ticker_period_ticks;
  g_host_transport->retainedTickerStep = g_ticker_step;
  g_host_transport->retainedTickerAccum = g_ticker_accum;
  g_host_transport->retainedTickerCount = g_ticker_count;
}

