lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static bool restore_hibernate_state(void) {
  if (g_host_transport->hibernateCookie != NRF54L15_VPR_TRANSPORT_HIBERNATE_COOKIE) {
    return false;
  }
  const uint32_t flags = g_host_transport->hibernateFlags;
  if ((flags & NRF54L15_VPR_TRANSPORT_HIBERNATE_FLAG_TICKER_VALID) == 0U) {
    clear_retained_hibernate_state();
    return false;
  }
  g_ticker_enabled =
      (flags & NRF54L15_VPR_TRANSPORT_HIBERNATE_FLAG_TICKER_ENABLED) != 0U ? 1U : 0U;
  g_ticker_period_ticks = g_host_transport->retainedTickerPeriodTicks;
  g_ticker_step = g_host_transport->retainedTickerStep;
  if (g_ticker_step == 0U) {
    g_ticker_step = 1U;
  }
  g_ticker_accum = g_host_transport->retainedTickerAccum;
  g_ticker_count = g_host_transport->retainedTickerCount;
  clear_retained_hibernate_state();
  return true;
}
#endif

static void write_le16(uint8_t *dst, uint16_t value) {
  if (dst == NULL) {
    return;
  }
  dst[0] = (uint8_t)(value & 0xFFU);
  dst[1] = (uint8_t)((value >> 8U) & 0xFFU);
}

static uint16_t read_le16(const volatile uint8_t *src) {
  if (src == NULL) {
    return 0U;
  }
  return (uint16_t)src[0] | ((uint16_t)src[1] << 8U);
}

static void write_le24(uint8_t *dst, uint32_t value) {
  if (dst == NULL) {
    return;
  }
  dst[0] = (uint8_t)(value & 0xFFU);
  dst[1] = (uint8_t)((value >> 8U) & 0xFFU);
  dst[2] = (uint8_t)((value >> 16U) & 0xFFU);
}

static uint32_t read_le24(const volatile uint8_t *src) {
  if (src == NULL) {
    return 0U;
  }
  return (uint32_t)src[0] | ((uint32_t)src[1] << 8U) | ((uint32_t)src[2] << 16U);
}

static void write_le32(uint8_t *dst, uint32_t value) {
  if (dst == NULL) {
    return;
  }
  dst[0] = (uint8_t)(value & 0xFFU);
  dst[1] = (uint8_t)((value >> 8U) & 0xFFU);
  dst[2] = (uint8_t)((value >> 16U) & 0xFFU);
  dst[3] = (uint8_t)((value >> 24U) & 0xFFU);
}

static void clear_ble_connection_handoff(void) {
  g_host_transport->reserved = 0U;
  for (uint8_t i = 0U; i < NRF54L15_VPR_BLE_CONN_HANDOFF_LEN; ++i) {
    g_host_transport->hostData[i] = 0U;
  }
}

#if VPR_CS_DEDICATED_IMAGE
static bool cs_builtin_peer_demo_active(void) {
  const uint32_t host_reserved = g_host_transport->reserved;
  if (host_reserved != 0U && host_reserved != NRF54L15_VPR_BLE_CONN_HANDOFF_COOKIE) {
    g_cs_builtin_peer_demo_enabled = 1U;
  }
  return g_cs_builtin_peer_demo_enabled != 0U;
}

static void consume_ble_connection_handoff(void) {
  if (g_host_transport->reserved != NRF54L15_VPR_BLE_CONN_HANDOFF_COOKIE) {
    return;
  }

  const uint8_t connected = g_host_transport->hostData[0];
  const uint16_t conn_handle = read_le16(&g_host_transport->hostData[1]);
  clear_ble_connection_handoff();
  if (connected == 0U || conn_handle == 0U) {
    return;
  }

  g_cs_session_conn_handle = conn_handle;
  g_cs_session_open = 1U;
  g_cs_config_id = 0U;
}
#endif

static uint16_t read_conn_handle(void) {
  if (g_host_transport->hostLen < 6U) {
    return 0x0040U;
  }
  return (uint16_t)g_host_transport->hostData[4] |
         ((uint16_t)g_host_transport->hostData[5] << 8U);
}

static uint16_t current_conn_handle(void) {
#if VPR_CS_DEDICATED_IMAGE
  return (g_cs_session_open != 0U) ? g_cs_session_conn_handle : read_conn_handle();
#else
  return read_conn_handle();
#endif
}

#if VPR_CS_DEDICATED_IMAGE
static uint32_t current_link_state_packed(void) {
  return ((uint32_t)(g_cs_session_conn_handle & 0x0FFFU)) |
         (((uint32_t)g_cs_last_interval_selector & 0x0FU) << 12U) |
         ((g_cs_session_open != 0U ? 1UL : 0UL) << 16U) |
         ((g_cs_config_created != 0U ? 1UL : 0UL) << 17U) |
         ((g_cs_security_enabled != 0U ? 1UL : 0UL) << 18U) |
         ((g_cs_procedure_params_applied != 0U ? 1UL : 0UL) << 19U) |
         ((g_cs_procedure_enabled != 0U ? 1UL : 0UL) << 20U) |
         ((uint32_t)g_cs_config_id << 21U) |
         (((uint32_t)g_cs_last_peer_gap_ticks & 0x07U) << 29U);
}

static bool append_unique_config_id(uint8_t config_id, uint8_t *ids, uint8_t *count) {
  if (ids == NULL || count == NULL || config_id == 0U) {
    return false;
  }
  for (uint8_t i = 0U; i < *count; ++i) {
    if (ids[i] == config_id) {
      return false;
    }
  }
  if (*count >= BLE_CS_MAX_TRACKED_CONFIG_IDS) {
    return false;
  }
  ids[*count] = config_id;
  *count = (uint8_t)(*count + 1U);
  return true;
}

static uint8_t current_unique_cs_config_count(void) {
  uint8_t ids[BLE_CS_MAX_TRACKED_CONFIG_IDS] = {0U};
  uint8_t count = 0U;
  if (g_cs_config_created != 0U && g_cs_config_id != 0U) {
    (void)append_unique_config_id(g_cs_config_id, ids, &count);
  }
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U) {
      (void)append_unique_config_id(g_cs_slots[i].configId, ids, &count);
    }
  }
  if (g_cs_previous_slot.inUse != 0U) {
    (void)append_unique_config_id(g_cs_previous_slot.configId, ids, &count);
  }
  return count;
}

static void current_authority_config_ids(uint8_t *out0, uint8_t *out1, uint8_t *out2) {
  uint8_t ids[BLE_CS_MAX_TRACKED_CONFIG_IDS] = {0U};
  uint8_t count = 0U;
  if (g_cs_config_created != 0U && g_cs_config_id != 0U) {
    (void)append_unique_config_id(g_cs_config_id, ids, &count);
  }
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U) {
      (void)append_unique_config_id(g_cs_slots[i].configId, ids, &count);
    }
  }
  if (g_cs_previous_slot.inUse != 0U) {
    (void)append_unique_config_id(g_cs_previous_slot.configId, ids, &count);
  }
  if (out0 != NULL) {
    *out0 = ids[0];
  }
  if (out1 != NULL) {
    *out1 = ids[1];
  }
  if (out2 != NULL) {
    *out2 = ids[2];
  }
}

static uint32_t current_link_state_aux_packed(void) {
  uint8_t authority2 = 0U;
  current_authority_config_ids(NULL, NULL, &authority2);
  return ((uint32_t)(current_unique_cs_config_count() & 0x0FU)) |
         (((uint32_t)g_cs_result_publish_debug_reason & 0x0FU) << 4U) |
         (((uint32_t)g_cs_last_peer_gap_ticks & 0x0FU) << 8U) |
         (((uint32_t)g_pending_cs_result_stage & 0x0FU) << 12U) |
         (((uint32_t)g_cs_last_evicted_config_id & 0xFFU) << 16U) |
         (((uint32_t)authority2 & 0xFFU) << 24U);
}

static uint32_t current_link_state_meta_packed(void) {
  uint8_t slot0_config_id = 0U;
  uint8_t slot1_config_id = 0U;
  uint8_t previous_config_id = 0U;
  uint8_t flags = 0U;
  uint8_t free_primary_slot_count = 0U;

  if (g_cs_slots[0].inUse != 0U) {
    slot0_config_id = g_cs_slots[0].configId;
    flags |= 0x01U;
  } else {
    ++free_primary_slot_count;
  }
  if (g_cs_slots[1].inUse != 0U) {
    slot1_config_id = g_cs_slots[1].configId;
    flags |= 0x02U;
  } else {
    ++free_primary_slot_count;
  }
  if (g_cs_previous_slot.inUse != 0U) {
    previous_config_id = g_cs_previous_slot.configId;
    flags |= 0x04U;
  }
  if (g_cs_config_created != 0U && slot0_config_id == g_cs_config_id) {
    flags |= 0x08U;
  }
  if (g_cs_config_created != 0U && slot1_config_id == g_cs_config_id) {
    flags |= 0x10U;
  }
  if (g_cs_config_created != 0U && previous_config_id == g_cs_config_id) {
    flags |= 0x20U;
  }
  flags |= (uint8_t)((free_primary_slot_count & 0x03U) << 6U);

  return (uint32_t)slot0_config_id | ((uint32_t)slot1_config_id << 8U) |
         ((uint32_t)previous_config_id << 16U) | ((uint32_t)flags << 24U);
}

static uint32_t current_link_state_config_packed(void) {
  uint32_t flags = 0U;
  uint8_t authority0 = 0U;
  uint8_t authority1 = 0U;
  current_authority_config_ids(&authority0, &authority1, NULL);

