lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
  if (g_cs_slots[0].inUse != 0U && g_cs_slots[0].securityEnabled != 0U &&
      g_cs_slots[0].procedureParamsApplied != 0U) {
    flags |= 0x01U;
  }
  if (g_cs_slots[1].inUse != 0U && g_cs_slots[1].securityEnabled != 0U &&
      g_cs_slots[1].procedureParamsApplied != 0U) {
    flags |= 0x02U;
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.securityEnabled != 0U &&
      g_cs_previous_slot.procedureParamsApplied != 0U) {
    flags |= 0x04U;
  }
  if (g_cs_config_created != 0U && g_cs_security_enabled != 0U &&
      g_cs_procedure_params_applied != 0U) {
    flags |= 0x08U;
  }
  if (g_cs_slots[0].inUse != 0U && g_cs_slots[0].securityEnabled != 0U) {
    flags |= 0x10U;
  }
  if (g_cs_slots[1].inUse != 0U && g_cs_slots[1].securityEnabled != 0U) {
    flags |= 0x20U;
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.securityEnabled != 0U) {
    flags |= 0x40U;
  }
  if (g_cs_config_created != 0U && g_cs_security_enabled != 0U) {
    flags |= 0x80U;
  }
  if (g_cs_slots[0].inUse != 0U && g_cs_slots[0].procedureParamsApplied != 0U) {
    flags |= 0x100U;
  }
  if (g_cs_slots[1].inUse != 0U && g_cs_slots[1].procedureParamsApplied != 0U) {
    flags |= 0x200U;
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.procedureParamsApplied != 0U) {
    flags |= 0x400U;
  }
  if (g_cs_config_created != 0U && g_cs_procedure_params_applied != 0U) {
    flags |= 0x800U;
  }
  flags |= ((uint32_t)authority0 << 12U);
  flags |= ((uint32_t)authority1 << 20U);
  flags |= (((uint32_t)g_measurement_execute_result_active & 0x01U) << 28U);
  flags |= (((uint32_t)g_cs_result_publish_debug_stage & 0x07U) << 29U);

  return flags;
}

static bool command_conn_handle_matches_active_link(void) {
  return (g_cs_session_open != 0U) && (read_conn_handle() == g_cs_session_conn_handle);
}
#endif

static size_t append_h4_command_status(uint8_t *dst, size_t max_len, uint16_t opcode,
                                       uint8_t status) {
  if (dst == NULL || max_len < 7U) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_STATUS;
  dst[2] = 4U;
  dst[3] = status;
  dst[4] = 1U;
  write_le16(&dst[5], opcode);
  return 7U;
}

static size_t append_h4_command_complete(uint8_t *dst, size_t max_len, uint16_t opcode,
                                         uint8_t status) {
  if (dst == NULL || max_len < 7U) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_COMPLETE;
  dst[2] = 4U;
  dst[3] = 1U;
  write_le16(&dst[4], opcode);
  dst[6] = status;
  return 7U;
}

static size_t append_h4_command_complete_payload(uint8_t *dst, size_t max_len,
                                                 uint16_t opcode, const uint8_t *payload,
                                                 size_t payload_len) {
  if (dst == NULL || (payload_len != 0U && payload == NULL) || max_len < (6U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_COMMAND_COMPLETE;
  dst[2] = (uint8_t)(3U + payload_len);
  dst[3] = 1U;
  write_le16(&dst[4], opcode);
  bytes_copy(&dst[6], payload,payload_len);
  return 6U + payload_len;
}

static size_t append_h4_le_meta(uint8_t *dst, size_t max_len, uint8_t subevent_code,
                                const uint8_t *payload, size_t payload_len) {
  if (dst == NULL || payload == NULL || max_len < (4U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_LE_META;
  dst[2] = (uint8_t)(1U + payload_len);
  dst[3] = subevent_code;
  bytes_copy(&dst[4], payload,payload_len);
  return 4U + payload_len;
}

static size_t append_h4_vendor_event(uint8_t *dst, size_t max_len, uint8_t subevent_code,
                                     const uint8_t *payload, size_t payload_len) {
  if (dst == NULL || payload == NULL || max_len < (4U + payload_len)) {
    return 0U;
  }
  dst[0] = BLE_HCI_PACKET_TYPE_EVENT;
  dst[1] = BLE_HCI_EVT_VENDOR;
  dst[2] = (uint8_t)(1U + payload_len);
  dst[3] = subevent_code;
  bytes_copy(&dst[4], payload,payload_len);
  return 4U + payload_len;
}

static const uint8_t k_local_demo_pct_sample[3] = {0x00U, 0x04U, 0x00U};
static const uint8_t k_generic_peer_demo_pct_sample[3] = {0xD1U, 0xE3U, 0xECU};
static uint16_t current_step_count_group(void);
static uint16_t current_channel_selection_group(void);
enum {
  VPR_CS_TONE_QUALITY_HIGH = 0x00U,
  VPR_CS_TONE_QUALITY_MEDIUM = 0x01U,
};
#if VPR_CS_DEDICATED_IMAGE
static const uint8_t k_peer_demo_pct_samples[39][3] = {
    {0xF0U, 0xB3U, 0xF4U}, {0xE2U, 0xC3U, 0xF0U}, {0xD1U, 0xE3U, 0xECU},
    {0xBCU, 0x13U, 0xE9U}, {0xA3U, 0x63U, 0xE5U}, {0x86U, 0xC3U, 0xE1U},
    {0x66U, 0x43U, 0xDEU}, {0x43U, 0xF3U, 0xDAU}, {0x1CU, 0xB3U, 0xD7U},
    {0xF2U, 0xB2U, 0xD4U}, {0xC4U, 0xD2U, 0xD1U}, {0x62U, 0xA2U, 0xCCU},
    {0x2DU, 0x52U, 0xCAU}, {0xF6U, 0x41U, 0xC8U}, {0xBDU, 0x61U, 0xC6U},
    {0x82U, 0xC1U, 0xC4U}, {0x46U, 0x51U, 0xC3U}, {0x08U, 0x31U, 0xC2U},
    {0xCAU, 0x40U, 0xC1U}, {0x8AU, 0x90U, 0xC0U}, {0x4AU, 0x30U, 0xC0U},
    {0x0AU, 0x00U, 0xC0U}, {0xC9U, 0x1FU, 0xC0U}, {0x89U, 0x7FU, 0xC0U},
    {0x4AU, 0x0FU, 0xC1U}, {0x0BU, 0xEFU, 0xC1U}, {0xCDU, 0xFEU, 0xC2U},
    {0x90U, 0x4EU, 0xC4U}, {0x55U, 0xDEU, 0xC5U}, {0x1BU, 0xAEU, 0xC7U},
    {0xE3U, 0xADU, 0xC9U}, {0xAEU, 0xEDU, 0xCBU}, {0x7AU, 0x5DU, 0xCEU},
    {0x4AU, 0xFDU, 0xD0U}, {0x1CU, 0xCDU, 0xD3U}, {0xF1U, 0xCCU, 0xD6U},
    {0xC9U, 0xFCU, 0xD9U}, {0xA4U, 0x4CU, 0xDDU}, {0x83U, 0xBCU, 0xE0U},
};

static int16_t clamp_pct12_component(int32_t value) {
  if (value < -2048) {
    return -2048;
  }
  if (value > 2047) {
    return 2047;
  }
  return (int16_t)value;
}

static int16_t decode_pct12_component(uint16_t bits) {
  return (int16_t)((bits ^ (1U << 11U)) - (1U << 11U));
}

static void decode_pct_sample_bytes(const uint8_t pct[3], int16_t *out_i, int16_t *out_q) {
  uint32_t packed = 0U;
  if (pct == NULL || out_i == NULL || out_q == NULL) {
    return;
  }
  packed = (uint32_t)pct[0] | ((uint32_t)pct[1] << 8U) | ((uint32_t)pct[2] << 16U);
  *out_i = decode_pct12_component((uint16_t)(packed & 0x0FFFU));
  *out_q = decode_pct12_component((uint16_t)((packed >> 12U) & 0x0FFFU));
}

