lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static uint32_t compute_procedure_interval_ticks(uint8_t *out_selector) {
  const uint32_t min_ticks =
      (g_cs_min_procedure_interval != 0U) ? (uint32_t)g_cs_min_procedure_interval : 1U;
  const uint32_t max_ticks =
      (g_cs_max_procedure_interval >= g_cs_min_procedure_interval &&
       g_cs_max_procedure_interval != 0U)
          ? (uint32_t)g_cs_max_procedure_interval
          : min_ticks;
  uint8_t selector_out = 0U;
  uint32_t ticks = min_ticks;
  if (max_ticks <= min_ticks) {
    ticks = min_ticks;
  } else if (g_cs_max_procedure_count <= 2U || g_cs_procedure_counter <= 1U) {
    ticks = min_ticks;
  } else {
    const uint32_t gap_index = (uint32_t)g_cs_procedure_counter - 1U;
    const uint32_t gap_span = (uint32_t)g_cs_max_procedure_count - 2U;
    uint32_t selector = (gap_index * 15U + (gap_span / 2U)) / gap_span;
    if (selector > 15U) {
      selector = 15U;
    }
    selector_out = (uint8_t)selector;
    ticks = min_ticks + (((max_ticks - min_ticks) * selector + 7U) / 15U);
  }
  if (out_selector != NULL) {
    *out_selector = selector_out;
  }
  return ticks;
}

static uint32_t current_procedure_interval_ticks(void) {
  uint8_t selector = 0U;
  const uint32_t ticks = compute_procedure_interval_ticks(&selector);
  g_cs_last_interval_selector = selector;
  return ticks;
}

static uint32_t current_peer_stage_delay_ticks(void) {
  uint32_t ticks = g_cs_min_subevent_len / 256U;
  if (ticks == 0U) {
    ticks = 1U;
  }
  if (ticks > 32U) {
    ticks = 32U;
  }
  return ticks;
}

static uint32_t current_subevent_stage_delay_ticks(void) {
  uint32_t ticks = g_cs_min_subevent_len / 192U;
  if (ticks == 0U) {
    ticks = 1U;
  }
  if (ticks > 16U) {
    ticks = 16U;
  }
  return ticks;
}

static uint32_t current_chunk_stage_delay_ticks(void) {
  uint32_t ticks = g_cs_min_subevent_len / 128U;
  if (ticks == 0U) {
    ticks = 1U;
  }
  if (ticks > 8U) {
    ticks = 8U;
  }
  return ticks;
}

static bool schedule_next_cs_procedure(void) {
  if (g_cs_session_open == 0U) { return false; }
  if (g_cs_procedure_enabled == 0U || g_pending_cs_result_stage != 0U ||
      g_cs_procedure_counter == 0U || g_cs_procedure_counter >= g_cs_max_procedure_count ||
      host_request_pending() ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) {
    return false;
  }
  if (g_vpr_transport->heartbeat < g_cs_next_procedure_heartbeat) {
    return false;
  }
  g_cs_procedure_counter = (uint16_t)(g_cs_procedure_counter + 1U);
  if (g_cs_procedure_counter == 0U) {
    g_cs_procedure_counter = 1U;
  }
  g_cs_active_subevent_index = 0U;
  g_pending_cs_result_stage = 1U;
  g_cs_local_chunk_start_step = current_demo_subevent_start_step(0U);
  g_cs_peer_chunk_start_step = current_demo_subevent_start_step(0U);
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  return true;
}

static bool schedule_next_cs_subevent(void) {
  const uint8_t subevent_count = current_demo_subevent_count();
  if (g_cs_session_open == 0U) { return false; }
  if (g_cs_procedure_enabled == 0U || g_pending_cs_result_stage != 0U ||
      g_cs_procedure_counter == 0U || subevent_count <= 1U ||
      g_cs_active_subevent_index + 1U >= subevent_count || host_request_pending() ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) {
    return false;
  }
  if (g_vpr_transport->heartbeat < g_cs_next_subevent_heartbeat) {
    return false;
  }
  g_cs_active_subevent_index = (uint8_t)(g_cs_active_subevent_index + 1U);
  g_pending_cs_result_stage = 1U;
  g_cs_local_chunk_start_step = current_demo_subevent_start_step(g_cs_active_subevent_index);
  g_cs_peer_chunk_start_step = g_cs_local_chunk_start_step;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  return true;
}
#endif

#if !VPR_CS_DEDICATED_IMAGE
static uint16_t current_channel_selection_group(void) { return 0U; }

static uint16_t current_step_count_group(void) { return 0U; }

static uint8_t current_ble_cs_workflow_completed_total_step_count(void) {
  return (uint8_t)(current_ble_cs_workflow_completed_mode1_count() +
                   current_ble_cs_workflow_completed_mode2_count());
}

static uint8_t current_ble_cs_workflow_completed_channel(uint8_t phase_step_index) {
  const uint32_t packed_channels = current_ble_cs_workflow_completed_demo_channels_packed();
  const uint8_t slot = (uint8_t)(phase_step_index & 0x03U);
  return (uint8_t)((packed_channels >> (slot * 8U)) & 0xFFU);
}

static size_t append_generic_ble_cs_local_result_step(uint8_t *dst, uint8_t step_index) {
  if (dst == NULL) {
    return 0U;
  }
  if (current_ble_cs_workflow_completed_mode1_count() != 0U && step_index == 0U) {
    return append_mode1_unavailable_step(dst, current_ble_cs_workflow_completed_channel(0U), 1U);
  }
  {
    const uint8_t phase_step_index =
        (uint8_t)(step_index - (current_ble_cs_workflow_completed_mode1_count() != 0U ? 1U : 0U));
    append_mode2_sample_step(dst, current_ble_cs_workflow_completed_channel(phase_step_index),
                             current_demo_antenna_permutation(phase_step_index),
                             ((phase_step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                                 : VPR_CS_TONE_QUALITY_HIGH,
                             k_local_demo_pct_sample);
  }
  return 8U;
}

static size_t append_generic_ble_cs_peer_result_step(uint8_t *dst, uint8_t step_index) {
  if (dst == NULL) {
    return 0U;
  }
  if (current_ble_cs_workflow_completed_mode1_count() != 0U && step_index == 0U) {
    return append_mode1_unavailable_step(dst, current_ble_cs_workflow_completed_channel(0U), 1U);
  }
  {
    const uint8_t phase_step_index =
        (uint8_t)(step_index - (current_ble_cs_workflow_completed_mode1_count() != 0U ? 1U : 0U));
    const uint8_t channel = current_ble_cs_workflow_completed_channel(phase_step_index);
    append_mode2_sample_step(dst, channel, current_demo_antenna_permutation(phase_step_index),
                             ((phase_step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                                 : VPR_CS_TONE_QUALITY_HIGH,
                             k_generic_peer_demo_pct_sample);
  }
  return 8U;
}

static uint16_t build_ble_cs_workflow_completed_result_payload(uint8_t *dst, size_t max_len,
                                                               bool peer_side) {
  const uint8_t total_steps = current_ble_cs_workflow_completed_total_step_count();
  size_t offset = 0U;
  if (dst == NULL || max_len < 15U || total_steps == 0U ||
      g_ble_cs_workflow_completed_config_id == 0U ||
      g_ble_cs_workflow_completed_procedure_count == 0U) {
    return 0U;
  }

  bytes_zero(dst, max_len);
  write_le16(&dst[0], g_ble_connection_conn_handle);
  dst[2] = g_ble_cs_workflow_completed_config_id;
  write_le16(&dst[3], 0x1200U);
  write_le16(&dst[5], g_ble_cs_workflow_completed_procedure_count);
  write_le16(&dst[7], 0x0010U);
  dst[9] = (uint8_t)(int8_t)-13;
  dst[10] = 0x00U;
  dst[11] = 0x00U;
  dst[12] = 0x00U;
  dst[13] = 1U;
  dst[14] = total_steps;
  offset = 15U;

  for (uint8_t step_index = 0U; step_index < total_steps; ++step_index) {
    const size_t step_len =
        peer_side ? append_generic_ble_cs_peer_result_step(&dst[offset], step_index)
                  : append_generic_ble_cs_local_result_step(&dst[offset], step_index);
    if (step_len == 0U || (offset + step_len) > max_len) {
      return 0U;
    }
    offset += step_len;
  }
  return (uint16_t)offset;
}

static void cache_ble_cs_workflow_completed_results(void) {
  g_ble_cs_workflow_completed_local_payload_len = build_ble_cs_workflow_completed_result_payload(
      g_ble_cs_workflow_completed_local_payload, sizeof(g_ble_cs_workflow_completed_local_payload),
      false);
  g_ble_cs_workflow_completed_peer_payload_len = build_ble_cs_workflow_completed_result_payload(
      g_ble_cs_workflow_completed_peer_payload, sizeof(g_ble_cs_workflow_completed_peer_payload),
      true);
  g_ble_cs_workflow_completed_local_hash32 =
      fnv1a32_bytes(g_ble_cs_workflow_completed_local_payload,
                    g_ble_cs_workflow_completed_local_payload_len);
  g_ble_cs_workflow_completed_peer_hash32 =
      fnv1a32_bytes(g_ble_cs_workflow_completed_peer_payload,
                    g_ble_cs_workflow_completed_peer_payload_len);
}

static size_t append_local_demo_step(uint8_t *dst, const uint8_t *channels,
                                     uint8_t step_index) {
  if (dst == NULL || channels == NULL) {
    return 0U;
  }
  append_mode2_demo_step(dst, channels[step_index & 0x03U], step_index);
  return 8U;
}
#endif

