lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_vendor_ticker_configure_complete_payload(uint8_t *payload, size_t max_len) {
  if (g_host_transport->hostLen >= 13U) {
    g_ticker_enabled = g_host_transport->hostData[4] != 0U ? 1U : 0U;
    g_ticker_period_ticks = (uint32_t)g_host_transport->hostData[5] |
                            ((uint32_t)g_host_transport->hostData[6] << 8U) |
                            ((uint32_t)g_host_transport->hostData[7] << 16U) |
                            ((uint32_t)g_host_transport->hostData[8] << 24U);
    g_ticker_step = (uint32_t)g_host_transport->hostData[9] |
                    ((uint32_t)g_host_transport->hostData[10] << 8U) |
                    ((uint32_t)g_host_transport->hostData[11] << 16U) |
                    ((uint32_t)g_host_transport->hostData[12] << 24U);
    if (g_ticker_step == 0U) {
      g_ticker_step = 1U;
    }
    g_ticker_accum = 0U;
    g_ticker_count = 0U;
    if (g_ticker_period_ticks == 0U) {
      g_ticker_enabled = 0U;
    }
  }
  return build_vendor_ticker_state_payload(payload, max_len);
}

static size_t build_vendor_ticker_event_configure_complete_payload(uint8_t *payload,
                                                                   size_t max_len) {
  if (payload == NULL || max_len < 14U) {
    return 0U;
  }
  if (g_host_transport->hostLen >= 9U) {
    g_ticker_event_enabled = g_host_transport->hostData[4] != 0U ? 1U : 0U;
    g_ticker_event_emit_every = (uint32_t)g_host_transport->hostData[5] |
                                ((uint32_t)g_host_transport->hostData[6] << 8U) |
                                ((uint32_t)g_host_transport->hostData[7] << 16U) |
                                ((uint32_t)g_host_transport->hostData[8] << 24U);
    if (g_ticker_event_emit_every == 0U) {
      g_ticker_event_enabled = 0U;
    }
    g_ticker_event_last_emitted_count = g_ticker_count;
    g_ticker_event_sequence = 0U;
    clear_ticker_event_queue();
    g_ticker_event_drop_count = 0U;
  }
  payload[0] = 0U;
  payload[1] = (uint8_t)(g_ticker_event_enabled != 0U ? 1U : 0U);
  write_le32(&payload[2], g_ticker_event_emit_every);
  write_le32(&payload[6], g_ticker_event_last_emitted_count);
  write_le32(&payload[10], g_ticker_event_drop_count);
  return 14U;
}

static size_t build_vendor_ticker_event_payload(uint8_t *payload, size_t max_len,
                                                const vpr_ticker_event_entry_t *event) {
  if (payload == NULL || event == NULL || max_len < 17U) {
    return 0U;
  }
  payload[0] = event->flags;
  write_le32(&payload[1], event->count);
  write_le32(&payload[5], event->step);
  write_le32(&payload[9], event->heartbeat);
  write_le32(&payload[13], event->sequence);
  return 17U;
}

static size_t build_vendor_ble_legacy_adv_state_payload(uint8_t *payload,
                                                        size_t max_len) {
  if (payload == NULL || max_len < 21U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = (uint8_t)(g_ble_legacy_adv_enabled != 0U ? 1U : 0U);
  payload[2] = normalize_ble_legacy_adv_channel_mask(g_ble_legacy_adv_channel_mask);
  payload[3] = (uint8_t)(g_ble_legacy_adv_add_random_delay != 0U ? 1U : 0U);
  payload[4] = g_ble_legacy_adv_last_channel_mask;
  write_le32(&payload[5], g_ble_legacy_adv_interval_ticks);
  write_le32(&payload[9], g_ble_legacy_adv_last_random_delay_ticks);
  write_le32(&payload[13], g_ble_legacy_adv_event_count);
  write_le32(&payload[17], g_ble_legacy_adv_event_drop_count);
  return 21U;
}

static size_t build_vendor_ble_legacy_adv_data_payload(uint8_t *payload,
                                                       size_t max_len,
                                                       uint8_t status) {
  const uint8_t len = (g_ble_legacy_adv_data_len <= sizeof(g_ble_legacy_adv_data))
                          ? g_ble_legacy_adv_data_len
                          : (uint8_t)sizeof(g_ble_legacy_adv_data);
  if (payload == NULL || max_len < (size_t)(2U + len)) {
    return 0U;
  }
  payload[0] = status;
  payload[1] = len;
  if (len != 0U) {
    bytes_copy(&payload[2], g_ble_legacy_adv_data, len);
  }
  return (size_t)(2U + len);
}

static size_t build_vendor_ble_connection_state_payload(uint8_t *payload,
                                                        size_t max_len,
                                                        uint8_t status) {
  if (payload == NULL || max_len < 22U) {
    return 0U;
  }
  payload[0] = status;
  payload[1] = (uint8_t)(g_ble_connection_connected != 0U ? 1U : 0U);
  write_le16(&payload[2], g_ble_connection_conn_handle);
  payload[4] = g_ble_connection_role;
  payload[5] = (uint8_t)(g_ble_connection_encrypted != 0U ? 1U : 0U);
  write_le16(&payload[6], g_ble_connection_interval_units);
  write_le16(&payload[8], g_ble_connection_latency);
  write_le16(&payload[10], g_ble_connection_supervision_timeout);
  payload[12] = g_ble_connection_tx_phy;
  payload[13] = g_ble_connection_rx_phy;
  write_le32(&payload[14], g_ble_connection_event_count);
  write_le32(&payload[18], g_ble_connection_disconnect_count);
  return 22U;
}

static size_t build_vendor_ble_cs_link_state_payload(uint8_t *payload,
                                                     size_t max_len,
                                                     uint8_t status) {
  if (payload == NULL || max_len < 12U) {
    return 0U;
  }
  payload[0] = status;
  payload[1] = (uint8_t)(g_ble_cs_link_bound != 0U ? 1U : 0U);
  payload[2] = ble_cs_link_runnable();
  payload[3] = (uint8_t)(g_ble_connection_connected != 0U ? 1U : 0U);
  payload[4] = (uint8_t)(g_ble_connection_encrypted != 0U ? 1U : 0U);
  write_le16(&payload[5], g_ble_cs_link_bound != 0U ? g_ble_connection_conn_handle : 0U);
  payload[7] = g_ble_cs_link_bound != 0U ? g_ble_connection_role : 0U;
  write_le32(&payload[8], g_ble_connection_event_count);
  return 12U;
}

static size_t build_vendor_ble_cs_workflow_state_payload(uint8_t *payload,
                                                         size_t max_len,
                                                         uint8_t status) {
  if (payload == NULL || max_len < 46U) {
    return 0U;
  }
  payload[0] = status;
  payload[1] = (uint8_t)(g_ble_cs_link_bound != 0U ? 1U : 0U);
  payload[2] = ble_cs_link_runnable();
  payload[3] = ble_cs_workflow_configured();
  payload[4] = (uint8_t)(g_ble_cs_workflow_procedure_enabled != 0U ? 1U : 0U);
  payload[5] = (uint8_t)(g_ble_cs_workflow_running != 0U ? 1U : 0U);
  payload[6] = (uint8_t)(g_ble_cs_workflow_completed != 0U ? 1U : 0U);
  payload[7] = (uint8_t)(g_ble_connection_connected != 0U ? 1U : 0U);
  payload[8] = (uint8_t)(g_ble_connection_encrypted != 0U ? 1U : 0U);
  write_le16(&payload[9], g_ble_cs_link_bound != 0U ? g_ble_connection_conn_handle : 0U);
  payload[11] = g_ble_cs_link_bound != 0U ? g_ble_connection_role : 0U;
  payload[12] = g_ble_cs_workflow_config_id;
  payload[13] = g_ble_cs_workflow_max_procedure_count;
  write_le32(&payload[14], g_ble_connection_event_count);
  payload[18] = g_ble_cs_workflow_completed_procedure_count;
  payload[19] = g_ble_cs_workflow_completed_config_id;
  write_le16(&payload[20], g_ble_cs_workflow_nominal_distance_q4);
  write_le32(&payload[22], g_ble_cs_workflow_runtime_event_count);
  payload[26] = g_ble_cs_workflow_completed_local_subevent_count;
  payload[27] = g_ble_cs_workflow_completed_peer_subevent_count;
  payload[28] = g_ble_cs_workflow_completed_local_step_count;
  payload[29] = g_ble_cs_workflow_completed_peer_step_count;
  payload[30] = g_ble_cs_workflow_completed_local_mode1_count;
  payload[31] = g_ble_cs_workflow_completed_peer_mode1_count;
  payload[32] = g_ble_cs_workflow_completed_local_mode2_count;
  payload[33] = g_ble_cs_workflow_completed_peer_mode2_count;
  write_le32(&payload[34], g_ble_cs_workflow_completed_demo_channels_packed);
  write_le32(&payload[38], g_ble_cs_workflow_completed_local_hash32);
  write_le32(&payload[42], g_ble_cs_workflow_completed_peer_hash32);
  return 46U;
}

static size_t build_vendor_ble_cs_workflow_completed_result_payload(uint8_t *payload,
                                                                    size_t max_len) {
  const uint8_t peer_side =
      (g_host_transport->hostLen >= 5U && g_host_transport->hostData[4] != 0U) ? 1U : 0U;
  const uint8_t *result_payload =
      peer_side != 0U ? g_ble_cs_workflow_completed_peer_payload
                      : g_ble_cs_workflow_completed_local_payload;
  const uint16_t result_len =
      peer_side != 0U ? g_ble_cs_workflow_completed_peer_payload_len
                      : g_ble_cs_workflow_completed_local_payload_len;
  const uint32_t result_hash =
      peer_side != 0U ? g_ble_cs_workflow_completed_peer_hash32
                      : g_ble_cs_workflow_completed_local_hash32;
  if (payload == NULL || max_len < (size_t)(12U + result_len)) {
    return 0U;
  }
  payload[0] = 0x00U;
  payload[1] = peer_side;
  payload[2] = (uint8_t)(g_ble_cs_workflow_completed != 0U ? 1U : 0U);
  payload[3] = g_ble_cs_workflow_completed_config_id;
  write_le16(&payload[4], g_ble_cs_workflow_completed_procedure_count);
  write_le16(&payload[6], result_len);
  if (result_len != 0U) {
    bytes_copy(&payload[8], result_payload, result_len);
  }
  write_le32(&payload[8U + result_len], result_hash);
  return (size_t)(12U + result_len);
}

