lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_vendor_ble_legacy_adv_configure_complete_payload(uint8_t *payload,
                                                                     size_t max_len) {
  if (g_host_transport->hostLen >= 11U) {
    const uint8_t enabled = g_host_transport->hostData[4] != 0U ? 1U : 0U;
    const uint32_t interval_ticks = (uint32_t)g_host_transport->hostData[5] |
                                    ((uint32_t)g_host_transport->hostData[6] << 8U) |
                                    ((uint32_t)g_host_transport->hostData[7] << 16U) |
                                    ((uint32_t)g_host_transport->hostData[8] << 24U);
    const uint8_t channel_mask =
        normalize_ble_legacy_adv_channel_mask(g_host_transport->hostData[9]);
    const uint8_t add_random_delay = g_host_transport->hostData[10] != 0U ? 1U : 0U;
    g_ble_legacy_adv_enabled =
        (enabled != 0U && interval_ticks != 0U) ? 1U : 0U;
    g_ble_legacy_adv_interval_ticks = interval_ticks;
    g_ble_legacy_adv_channel_mask = channel_mask;
    g_ble_legacy_adv_add_random_delay = add_random_delay;
    g_ble_legacy_adv_last_channel_mask = 0U;
    g_ble_legacy_adv_event_count = 0U;
    g_ble_legacy_adv_last_random_delay_ticks = 0U;
    g_ble_legacy_adv_event_sequence = 0U;
    g_ble_legacy_adv_event_drop_count = 0U;
    clear_ble_legacy_adv_event_queue();
    g_ble_legacy_adv_next_channel_index = 0U;
    g_ble_legacy_adv_next_heartbeat =
        g_vpr_transport->heartbeat + g_ble_legacy_adv_interval_ticks;
  }
  return build_vendor_ble_legacy_adv_state_payload(payload, max_len);
}

static size_t build_vendor_ble_legacy_adv_write_data_complete_payload(uint8_t *payload,
                                                                      size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 5U) {
    status = 0x12U;
  } else {
    const uint8_t len = g_host_transport->hostData[4];
    if (len > sizeof(g_ble_legacy_adv_data) ||
        g_host_transport->hostLen < (uint16_t)(5U + len)) {
      status = 0x12U;
    } else {
      g_ble_legacy_adv_data_len = len;
      if (len != 0U) {
        const uint8_t *host_data = (const uint8_t *)&g_host_transport->hostData[5];
        bytes_copy(g_ble_legacy_adv_data, host_data, len);
      }
      if (len < sizeof(g_ble_legacy_adv_data)) {
        bytes_zero(&g_ble_legacy_adv_data[len],
                   sizeof(g_ble_legacy_adv_data) - len);
      }
    }
  }
  return build_vendor_ble_legacy_adv_data_payload(payload, max_len, status);
}

static size_t build_vendor_ble_connection_configure_complete_payload(uint8_t *payload,
                                                                     size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 16U) {
    status = 0x12U;
  } else {
    const uint16_t conn_handle =
        (uint16_t)g_host_transport->hostData[4] |
        ((uint16_t)g_host_transport->hostData[5] << 8U);
    const uint8_t role = g_host_transport->hostData[6];
    const uint8_t encrypted = g_host_transport->hostData[7] != 0U ? 1U : 0U;
    const uint16_t interval_units =
        (uint16_t)g_host_transport->hostData[8] |
        ((uint16_t)g_host_transport->hostData[9] << 8U);
    const uint16_t latency =
        (uint16_t)g_host_transport->hostData[10] |
        ((uint16_t)g_host_transport->hostData[11] << 8U);
    const uint16_t supervision_timeout =
        (uint16_t)g_host_transport->hostData[12] |
        ((uint16_t)g_host_transport->hostData[13] << 8U);
    const uint8_t tx_phy = g_host_transport->hostData[14];
    const uint8_t rx_phy = g_host_transport->hostData[15];
    if (conn_handle == 0U || interval_units == 0U || supervision_timeout == 0U) {
      status = 0x12U;
    } else if (g_ble_connection_connected != 0U &&
               g_ble_connection_conn_handle != conn_handle) {
      status = 0x0CU;
    } else {
      const uint8_t was_connected = (uint8_t)(g_ble_connection_connected != 0U ? 1U : 0U);
      g_ble_connection_connected = 1U;
      g_ble_connection_conn_handle = conn_handle;
      g_ble_connection_role = role;
      g_ble_connection_encrypted = encrypted;
      g_ble_connection_interval_units = interval_units;
      g_ble_connection_latency = latency;
      g_ble_connection_supervision_timeout = supervision_timeout;
      g_ble_connection_tx_phy = tx_phy;
      g_ble_connection_rx_phy = rx_phy;
      if (was_connected == 0U) {
        g_ble_connection_event_count = g_ble_connection_event_count + 1U;
        (void)enqueue_ble_connection_event(0x01U, 0x00U);
      }
      if (g_ble_cs_link_bound != 0U && g_ble_cs_workflow_procedure_enabled != 0U) {
        maybe_start_ble_cs_workflow_runtime();
      }
    }
  }
  return build_vendor_ble_connection_state_payload(payload, max_len, status);
}

static size_t build_vendor_ble_connection_disconnect_complete_payload(uint8_t *payload,
                                                                      size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 7U) {
    status = 0x12U;
  } else {
    const uint16_t conn_handle =
        (uint16_t)g_host_transport->hostData[4] |
        ((uint16_t)g_host_transport->hostData[5] << 8U);
    const uint8_t reason = g_host_transport->hostData[6];
    if (g_ble_connection_connected == 0U || g_ble_connection_conn_handle != conn_handle) {
      status = 0x02U;
    } else {
      g_ble_cs_link_bound = 0U;
      g_ble_connection_connected = 0U;
      g_ble_connection_event_count = g_ble_connection_event_count + 1U;
      g_ble_connection_disconnect_count = g_ble_connection_disconnect_count + 1U;
      (void)enqueue_ble_connection_event(0x02U, reason);
      g_ble_connection_conn_handle = 0U;
      g_ble_connection_role = 0U;
      g_ble_connection_encrypted = 0U;
      g_ble_connection_interval_units = 0U;
      g_ble_connection_latency = 0U;
      g_ble_connection_supervision_timeout = 0U;
      g_ble_connection_tx_phy = 0U;
      g_ble_connection_rx_phy = 0U;
      clear_ble_cs_workflow_state();
    }
  }
  return build_vendor_ble_connection_state_payload(payload, max_len, status);
}

static size_t build_vendor_ble_cs_link_configure_complete_payload(uint8_t *payload,
                                                                  size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 7U) {
    status = 0x12U;
  } else {
    const uint8_t enable = g_host_transport->hostData[4] != 0U ? 1U : 0U;
    const uint16_t conn_handle =
        (uint16_t)g_host_transport->hostData[5] |
        ((uint16_t)g_host_transport->hostData[6] << 8U);
    if (enable == 0U) {
      g_ble_cs_link_bound = 0U;
      clear_ble_cs_workflow_state();
    } else if (g_ble_connection_connected == 0U || g_ble_connection_conn_handle == 0U ||
               g_ble_connection_conn_handle != conn_handle) {
      status = 0x02U;
    } else {
      g_ble_cs_link_bound = 1U;
      if (g_ble_cs_workflow_procedure_enabled != 0U) {
        maybe_start_ble_cs_workflow_runtime();
      }
    }
  }
  return build_vendor_ble_cs_link_state_payload(payload, max_len, status);
}

static size_t build_vendor_ble_cs_workflow_configure_complete_payload(uint8_t *payload,
                                                                      size_t max_len) {
  uint8_t status = 0x00U;
  if (g_host_transport->hostLen < 11U) {
    status = 0x12U;
  } else {
    const uint8_t config_id = g_host_transport->hostData[4];
    const uint8_t defaults_applied = g_host_transport->hostData[5] != 0U ? 1U : 0U;
    const uint8_t config_created = g_host_transport->hostData[6] != 0U ? 1U : 0U;
    const uint8_t security_enabled = g_host_transport->hostData[7] != 0U ? 1U : 0U;
    const uint8_t params_applied = g_host_transport->hostData[8] != 0U ? 1U : 0U;
    const uint8_t procedure_enabled = g_host_transport->hostData[9] != 0U ? 1U : 0U;
    const uint8_t max_procedure_count = g_host_transport->hostData[10];
    if (defaults_applied == 0U) {
      clear_ble_cs_workflow_state();
    } else if (g_ble_cs_link_bound == 0U || g_ble_connection_connected == 0U ||
               g_ble_connection_conn_handle == 0U) {
      status = 0x02U;
      clear_ble_cs_workflow_state();
    } else if (config_id == 0U ||
               ((params_applied != 0U || procedure_enabled != 0U) &&
                max_procedure_count == 0U)) {
      status = 0x12U;
      clear_ble_cs_workflow_state();
    } else {
      g_ble_cs_workflow_defaults_applied = 1U;
      g_ble_cs_workflow_config_created = config_created;
      g_ble_cs_workflow_config_id = config_created != 0U ? config_id : 0U;
      g_ble_cs_workflow_security_enabled =
          (uint8_t)((g_ble_cs_workflow_config_created != 0U &&
                     security_enabled != 0U && g_ble_connection_encrypted != 0U)
                        ? 1U
                        : 0U);
      g_ble_cs_workflow_params_applied =
          (uint8_t)((g_ble_cs_workflow_config_created != 0U && params_applied != 0U)
                        ? 1U
                        : 0U);
      g_ble_cs_workflow_max_procedure_count =
          g_ble_cs_workflow_params_applied != 0U ? max_procedure_count : 0U;
      g_ble_cs_workflow_procedure_enabled =
          (uint8_t)((g_ble_cs_workflow_security_enabled != 0U &&
                     g_ble_cs_workflow_params_applied != 0U &&
                     procedure_enabled != 0U && ble_cs_link_runnable() != 0U)
                        ? 1U
                        : 0U);
      maybe_start_ble_cs_workflow_runtime();
    }
  }
  return build_vendor_ble_cs_workflow_state_payload(payload, max_len, status);
}

