lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static uint32_t build_measurement_rf_primitive_token(uint8_t version,
                                                     uint8_t flags,
                                                     uint8_t status,
                                                     uint32_t state_before,
                                                     uint32_t pll_wait_loops,
                                                     uint32_t disable_wait_loops,
                                                     uint32_t state_after) {
  return 0xC8000000UL ^
         state_before ^
         (pll_wait_loops << 1U) ^
         (disable_wait_loops << 2U) ^
         (state_after << 3U) ^
         ((uint32_t)flags << 16U) ^
         ((uint32_t)status << 24U) ^
         (uint32_t)version;
}

static uint32_t build_measurement_rf_retune_token(uint8_t version,
                                                  uint8_t flags,
                                                  uint8_t status,
                                                  uint8_t channel,
                                                  uint32_t target_frequency,
                                                  uint32_t target_datawhite,
                                                  uint32_t observed_frequency,
                                                  uint32_t observed_datawhite) {
  return 0xCA000000UL ^
         target_frequency ^
         (observed_frequency << 1U) ^
         target_datawhite ^
         (observed_datawhite << 2U) ^
         ((uint32_t)channel << 8U) ^
         ((uint32_t)flags << 16U) ^
         ((uint32_t)status << 24U) ^
         (uint32_t)version;
}

static uint32_t build_measurement_tone_snapshot_token(uint8_t version,
                                                      uint8_t flags,
                                                      uint8_t status,
                                                      uint32_t pct16,
                                                      uint32_t mag_phase,
                                                      uint32_t mag_std,
                                                      uint32_t frequency,
                                                      uint32_t state,
                                                      uint32_t cstones_end_event) {
  return 0xC9000000UL ^
         pct16 ^
         (mag_phase << 1U) ^
         (mag_std << 2U) ^
         (frequency << 3U) ^
         state ^
         (cstones_end_event << 4U) ^
         ((uint32_t)flags << 16U) ^
         ((uint32_t)status << 24U) ^
         (uint32_t)version;
}

#define VPR_NRF_RADIO_BASE 0x5008A000UL
#define VPR_NRF_RADIO_TASKS_TXEN_OFFSET 0x000UL
#define VPR_NRF_RADIO_TASKS_RXEN_OFFSET 0x004UL
#define VPR_NRF_RADIO_TASKS_START_OFFSET 0x008UL
#define VPR_NRF_RADIO_TASKS_DISABLE_OFFSET 0x010UL
#define VPR_NRF_RADIO_TASKS_PLLEN_OFFSET 0x06CUL
#define VPR_NRF_RADIO_EVENTS_TXREADY_OFFSET 0x204UL
#define VPR_NRF_RADIO_EVENTS_RXREADY_OFFSET 0x208UL
#define VPR_NRF_RADIO_EVENTS_END_OFFSET 0x218UL
#define VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET 0x220UL
#define VPR_NRF_RADIO_EVENTS_CRCOK_OFFSET 0x22CUL
#define VPR_NRF_RADIO_EVENTS_CRCERROR_OFFSET 0x230UL
#define VPR_NRF_RADIO_EVENTS_CSTONESEND_OFFSET 0x2C8UL
#define VPR_NRF_RADIO_EVENTS_PLLREADY_OFFSET 0x2B0UL
#define VPR_NRF_RADIO_SHORTS_OFFSET 0x400UL
#define VPR_NRF_RADIO_SHORTS_TXREADY_START_Msk (1UL << 17U)
#define VPR_NRF_RADIO_SHORTS_RXREADY_START_Msk (1UL << 18U)
#define VPR_NRF_RADIO_SHORTS_PHYEND_DISABLE_Msk (1UL << 19U)
#define VPR_NRF_RADIO_MODE_OFFSET 0x500UL
#define VPR_NRF_RADIO_STATE_OFFSET 0x520UL
#define VPR_NRF_RADIO_DATAWHITE_OFFSET 0x540UL
#define VPR_NRF_RADIO_FREQUENCY_OFFSET 0x708UL
#define VPR_NRF_RADIO_RSSISAMPLE_OFFSET 0x718UL
#define VPR_NRF_RADIO_DFEPACKET_PTR_OFFSET 0xD50UL
#define VPR_NRF_RADIO_DFEPACKET_AMOUNT_OFFSET 0xD58UL
#define VPR_NRF_RADIO_DFEPACKET_CURRENTAMOUNT_OFFSET 0xD5CUL
#define VPR_NRF_RADIO_CRCSTATUS_OFFSET 0xE0CUL
#define VPR_NRF_RADIO_PCNF0_OFFSET 0xE20UL
#define VPR_NRF_RADIO_PCNF1_OFFSET 0xE28UL
#define VPR_NRF_RADIO_PACKETPTR_OFFSET 0xED0UL
#define VPR_NRF_RADIO_CSTONES_MODE_OFFSET 0x1000UL
#define VPR_NRF_RADIO_CSTONES_PCT16_OFFSET 0x1020UL
#define VPR_NRF_RADIO_CSTONES_MAGPHASEMEAN_OFFSET 0x1024UL
#define VPR_NRF_RADIO_CSTONES_MAGSTD_OFFSET 0x102CUL
#define VPR_NRF_RADIO_CSTONES_DOWNSAMPLE_OFFSET 0x1038UL
#define VPR_RF_PRIMITIVE_PLL_WAIT_MAX_LOOPS 50000UL
#define VPR_RF_PRIMITIVE_DISABLE_WAIT_MAX_LOOPS 50000UL
#define VPR_RF_PRIMITIVE_STATUS_OK 0U
#define VPR_RF_PRIMITIVE_STATUS_NOT_ACCEPTED 1U
#define VPR_RF_PRIMITIVE_STATUS_RADIO_BUSY 2U
#define VPR_RF_PRIMITIVE_STATUS_PLL_TIMEOUT 3U
#define VPR_RF_PRIMITIVE_STATUS_DISABLE_TIMEOUT 4U
#define VPR_RF_PRIMITIVE_FLAG_VALID 0x01U
#define VPR_RF_PRIMITIVE_FLAG_PLL_READY 0x02U
#define VPR_RF_PRIMITIVE_FLAG_DISABLED 0x04U
#define VPR_RF_RETUNE_STATUS_OK 0U
#define VPR_RF_RETUNE_STATUS_NOT_ACCEPTED 1U
#define VPR_RF_RETUNE_STATUS_INVALID_CHANNEL 2U
#define VPR_RF_RETUNE_STATUS_RADIO_BUSY 3U
#define VPR_RF_RETUNE_STATUS_VERIFY_FAILED 4U
#define VPR_RF_RETUNE_FLAG_VALID 0x01U
#define VPR_RF_RETUNE_FLAG_MODE_WRITTEN 0x02U
#define VPR_RF_RETUNE_FLAG_FREQUENCY_WRITTEN 0x04U
#define VPR_RF_RETUNE_FLAG_DATAWHITE_WRITTEN 0x08U
#define VPR_RF_RX_PRIMITIVE_RXREADY_WAIT_MAX_LOOPS 50000UL
#define VPR_RF_RX_PRIMITIVE_DISABLE_WAIT_MAX_LOOPS 50000UL
#define VPR_RF_RX_PRIMITIVE_STATUS_OK 0U
#define VPR_RF_RX_PRIMITIVE_STATUS_NOT_ACCEPTED 1U
#define VPR_RF_RX_PRIMITIVE_STATUS_RADIO_BUSY 2U
#define VPR_RF_RX_PRIMITIVE_STATUS_RXREADY_TIMEOUT 3U
#define VPR_RF_RX_PRIMITIVE_STATUS_DISABLE_TIMEOUT 4U
#define VPR_RF_RX_PRIMITIVE_FLAG_VALID 0x01U
#define VPR_RF_RX_PRIMITIVE_FLAG_RX_READY 0x02U
#define VPR_RF_RX_PRIMITIVE_FLAG_DISABLED 0x04U
#define VPR_RF_PACKET_CONFIG_FLAG_VALID 0x01U
#define VPR_RF_PACKET_CONFIG_FLAG_PACKET_WRITTEN 0x02U
#define VPR_RF_PACKET_CONFIG_FLAG_PACKETPTR_WRITTEN 0x04U
#define VPR_RF_PACKET_CONFIG_FLAG_PACKETPTR_RESTORED 0x08U
#define VPR_RF_PACKET_CONFIG_FLAG_TX_READY 0x10U
#define VPR_RF_PACKET_CONFIG_FLAG_TX_DISABLED 0x20U
#define VPR_RF_PACKET_CONFIG_FLAG_TX_STARTED 0x40U
#define VPR_RF_PACKET_CONFIG_FLAG_TX_END 0x80U
#define VPR_RF_TIMED_MODE2_TX_WAIT_MAX_LOOPS 50000UL
#define VPR_RF_TIMED_MODE2_RXREADY_WAIT_MAX_LOOPS 50000UL
#define VPR_RF_TIMED_MODE2_DISABLE_WAIT_MAX_LOOPS 50000UL
#define VPR_RF_TIMED_MODE2_GAP_WAIT_MAX_LOOPS 4096UL
#define VPR_RF_TIMED_MODE2_LISTEN_WAIT_MAX_LOOPS 8192UL
#define VPR_RF_TIMED_MODE2_LOOP_SCALE_US 8U
#define VPR_RF_TIMED_MODE2_STATUS_OK 0U
#define VPR_RF_TIMED_MODE2_STATUS_NOT_ACCEPTED 1U
#define VPR_RF_TIMED_MODE2_STATUS_INVALID_CHANNEL 2U
#define VPR_RF_TIMED_MODE2_STATUS_RADIO_BUSY 3U
#define VPR_RF_TIMED_MODE2_STATUS_TX_TIMEOUT 4U
#define VPR_RF_TIMED_MODE2_STATUS_RXREADY_TIMEOUT 5U
#define VPR_RF_TIMED_MODE2_STATUS_DISABLE_TIMEOUT 6U
#define VPR_RF_TIMED_MODE2_FLAG_VALID 0x01U
#define VPR_RF_TIMED_MODE2_FLAG_TX_READY 0x02U
#define VPR_RF_TIMED_MODE2_FLAG_TX_END 0x04U
#define VPR_RF_TIMED_MODE2_FLAG_RX_READY 0x08U
#define VPR_RF_TIMED_MODE2_FLAG_RX_END 0x10U
#define VPR_RF_TIMED_MODE2_FLAG_DISABLED 0x20U
#define VPR_RF_TIMED_MODE2_FLAG_TIMING_APPLIED 0x40U
#define VPR_RF_TIMED_MODE2_FLAG_PACKETPTR_RESTORED 0x80U
#define VPR_RF_TIMED_MODE2_OBS_VALID 0x01U
#define VPR_RF_TIMED_MODE2_OBS_RX_END 0x02U
#define VPR_RF_TIMED_MODE2_OBS_CRC_OK 0x04U
#define VPR_RF_TIMED_MODE2_OBS_CRC_ERROR 0x08U
#define VPR_RF_TIMED_MODE2_OBS_HEADER_PRESENT 0x10U
#define VPR_RF_TIMED_MODE2_OBS_MAGIC_MATCH 0x20U
#define VPR_RF_TIMED_MODE2_OBS_REPORT_TYPE 0x40U
#define VPR_RF_TIMED_MODE2_OBS_CHANNEL_MATCH 0x80U
#define VPR_RADIO_MODE_BLE_2MBIT 3UL
#define VPR_RADIO_PACKET_MAX_PAYLOAD_DEFAULT 32U
#define VPR_RADIO_PACKET_PCNF0_DEFAULT 0x01080108UL
#define VPR_RADIO_PACKET_PCNF1_DEFAULT 0x02030020UL
#define VPR_CS_PACKET_PAYLOAD_LEN 6U
#define VPR_CS_PACKET_MAGIC0 0x43U
#define VPR_CS_PACKET_MAGIC1 0x53U
#define VPR_CS_PACKET_TYPE_PROBE 0x50U
#define VPR_CS_PACKET_TYPE_REPORT 0x51U
#define VPR_TONE_SNAPSHOT_FLAG_VALID 0x01U
#define VPR_TONE_SNAPSHOT_FLAG_NONZERO_SAMPLE 0x02U
#define VPR_TONE_SNAPSHOT_FLAG_RADIO_DISABLED 0x04U
#define VPR_TONE_SNAPSHOT_FLAG_DFE_PACKET 0x10U
#define VPR_TONE_SNAPSHOT_FLAG_TONE_CONFIG 0x20U
#define VPR_RF_TIMED_MODE2_RESULT_MAX 6U

