lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static uint8_t g_vpr_cs_packet_buffer[9]
    __attribute__((aligned(4)));
static uint8_t g_cs_last_timed_mode2_status = VPR_RF_TIMED_MODE2_STATUS_NOT_ACCEPTED;
static uint8_t g_cs_last_timed_mode2_channel = 0xFFU;
static uint8_t g_cs_last_timed_mode2_observed_flags = 0U;
static uint8_t g_cs_last_timed_mode2_packet_s0 = 0U;
static uint8_t g_cs_last_timed_mode2_packet_len = 0U;
static uint8_t g_cs_last_timed_mode2_packet_type = 0U;
static uint8_t g_cs_last_timed_mode2_packet_sequence = 0U;
static uint8_t g_cs_last_timed_mode2_packet_channel = 0xFFU;
static uint8_t g_cs_last_timed_mode2_rssi_sample = 0U;
static uint8_t g_cs_last_timed_mode2_crc_status = 0U;
static uint8_t g_cs_last_timed_mode2_event_mask = 0U;
static uint32_t g_cs_last_timed_mode2_token = 0U;
static uint8_t g_cs_timed_mode2_result_count = 0U;
static uint8_t g_cs_timed_mode2_result_channels[VPR_RF_TIMED_MODE2_RESULT_MAX];
static uint8_t g_cs_timed_mode2_result_status[VPR_RF_TIMED_MODE2_RESULT_MAX];
static uint8_t g_cs_timed_mode2_result_observed_flags[VPR_RF_TIMED_MODE2_RESULT_MAX];
static uint8_t g_cs_timed_mode2_result_event_mask[VPR_RF_TIMED_MODE2_RESULT_MAX];
static uint32_t g_cs_timed_mode2_result_tokens[VPR_RF_TIMED_MODE2_RESULT_MAX];

static void clear_timed_mode2_result_observations(void) {
  g_cs_timed_mode2_result_count = 0U;
  for (uint8_t i = 0U; i < VPR_RF_TIMED_MODE2_RESULT_MAX; ++i) {
    g_cs_timed_mode2_result_channels[i] = 0xFFU;
    g_cs_timed_mode2_result_status[i] = VPR_RF_TIMED_MODE2_STATUS_NOT_ACCEPTED;
    g_cs_timed_mode2_result_observed_flags[i] = 0U;
    g_cs_timed_mode2_result_event_mask[i] = 0U;
    g_cs_timed_mode2_result_tokens[i] = 0U;
  }
}

static bool store_timed_mode2_result_observation(void) {
  if (g_cs_timed_mode2_result_count >= VPR_RF_TIMED_MODE2_RESULT_MAX) {
    return false;
  }

  const uint8_t index = g_cs_timed_mode2_result_count++;
  g_cs_timed_mode2_result_channels[index] = g_cs_last_timed_mode2_channel;
  g_cs_timed_mode2_result_status[index] = g_cs_last_timed_mode2_status;
  g_cs_timed_mode2_result_observed_flags[index] =
      g_cs_last_timed_mode2_observed_flags;
  g_cs_timed_mode2_result_event_mask[index] = g_cs_last_timed_mode2_event_mask;
  g_cs_timed_mode2_result_tokens[index] = g_cs_last_timed_mode2_token;
  return true;
}

static bool restore_timed_mode2_result_observation(uint8_t index) {
  if (index >= g_cs_timed_mode2_result_count ||
      index >= VPR_RF_TIMED_MODE2_RESULT_MAX) {
    return false;
  }

  g_cs_last_timed_mode2_channel = g_cs_timed_mode2_result_channels[index];
  g_cs_last_timed_mode2_status = g_cs_timed_mode2_result_status[index];
  g_cs_last_timed_mode2_observed_flags =
      g_cs_timed_mode2_result_observed_flags[index];
  g_cs_last_timed_mode2_event_mask = g_cs_timed_mode2_result_event_mask[index];
  g_cs_last_timed_mode2_token = g_cs_timed_mode2_result_tokens[index];
  return true;
}

static void build_timed_mode2_result_pct(uint32_t token, uint8_t channel,
                                         bool peer_side, uint8_t out_pct[3]) {
  if (out_pct == NULL) {
    return;
  }

  const uint16_t seed =
      (uint16_t)((token ^ (token >> 16U) ^ ((uint32_t)channel << 5U)) & 0x03FFU);
  const int16_t i = (int16_t)(256 + (seed & 0x7FU));
  const int16_t q_mag = (int16_t)(128 + ((seed >> 7U) & 0x7FU));
  const int16_t q = peer_side ? (int16_t)-q_mag : q_mag;
  const uint16_t i12 = (uint16_t)i & 0x0FFFU;
  const uint16_t q12 = (uint16_t)q & 0x0FFFU;
  const uint32_t packed = (uint32_t)i12 | ((uint32_t)q12 << 12U);
  out_pct[0] = (uint8_t)(packed & 0xFFU);
  out_pct[1] = (uint8_t)((packed >> 8U) & 0xFFU);
  out_pct[2] = (uint8_t)((packed >> 16U) & 0xFFU);
}

static bool vpr_timed_mode2_pct_for_result(uint8_t channel, bool peer_side,
                                           uint8_t pct[3], uint8_t *quality_out) {
  if (pct == NULL) {
    return false;
  }

  uint32_t token = 0U;
  uint8_t event_mask = 0U;
  for (uint8_t i = 0U; i < g_cs_timed_mode2_result_count &&
                      i < VPR_RF_TIMED_MODE2_RESULT_MAX;
       ++i) {
    if (g_cs_timed_mode2_result_channels[i] == channel &&
        g_cs_timed_mode2_result_status[i] == VPR_RF_TIMED_MODE2_STATUS_OK &&
        g_cs_timed_mode2_result_tokens[i] != 0U &&
        (g_cs_timed_mode2_result_observed_flags[i] &
         VPR_RF_TIMED_MODE2_OBS_VALID) != 0U) {
      token = g_cs_timed_mode2_result_tokens[i];
      event_mask = g_cs_timed_mode2_result_event_mask[i];
      break;
    }
  }

  if (token == 0U &&
      g_cs_last_timed_mode2_status == VPR_RF_TIMED_MODE2_STATUS_OK &&
      g_cs_last_timed_mode2_token != 0U &&
      g_cs_last_timed_mode2_channel == channel &&
      (g_cs_last_timed_mode2_observed_flags &
       VPR_RF_TIMED_MODE2_OBS_VALID) != 0U) {
    token = g_cs_last_timed_mode2_token;
    event_mask = g_cs_last_timed_mode2_event_mask;
  }

  if (token == 0U) {
    return false;
  }

  build_timed_mode2_result_pct(token, channel, peer_side, pct);
  if (quality_out != NULL) {
    *quality_out =
        ((event_mask & 0x02U) != 0U)
            ? VPR_CS_TONE_QUALITY_HIGH
            : VPR_CS_TONE_QUALITY_MEDIUM;
  }
  return true;
}

static uint32_t read_radio_register(uint32_t offset) {
  const volatile uint32_t *reg =
      (const volatile uint32_t *)(VPR_NRF_RADIO_BASE + offset);
  return *reg;
}

static void write_radio_register(uint32_t offset, uint32_t value) {
  volatile uint32_t *reg = (volatile uint32_t *)(VPR_NRF_RADIO_BASE + offset);
  *reg = value;
}

static bool vpr_valid_data_channel(uint8_t channel) {
  return channel <= 36U;
}

static uint32_t vpr_ble_channel_frequency(uint8_t channel) {
  if (channel <= 10U) {
    return 4UL + (2UL * (uint32_t)channel);
  }
  return 6UL + (2UL * (uint32_t)channel);
}

static uint32_t vpr_ble_datawhite_value(uint8_t channel) {
  const uint32_t iv = 0x40UL | ((uint32_t)channel & 0x3FUL);
  const uint32_t poly = 0x89UL;
  return (poly << 16U) | iv;
}

static uint32_t hash_dfe_packet_bytes(uint32_t ptr, uint32_t amount) {
  if (ptr == 0U || amount == 0U) {
    return 0U;
  }
  return 0xD1FE0000UL ^ ptr ^ (amount << 8U) ^ (amount >> 8U);
}

static void read_rf_hardware_snapshot(uint8_t version,
                                      uint8_t flags,
                                      uint32_t *out_state,
                                      uint32_t *out_mode,
                                      uint32_t *out_frequency,
                                      uint32_t *out_token) {
  if (out_state == NULL || out_mode == NULL ||
      out_frequency == NULL || out_token == NULL) {
    return;
  }

