lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
  const uint32_t state = read_radio_register(VPR_NRF_RADIO_STATE_OFFSET);
  const uint32_t mode = read_radio_register(VPR_NRF_RADIO_MODE_OFFSET);
  const uint32_t frequency =
      read_radio_register(VPR_NRF_RADIO_FREQUENCY_OFFSET);

  *out_state = state;
  *out_mode = mode;
  *out_frequency = frequency;
  *out_token = build_measurement_rf_hardware_token(version, flags, state, mode,
                                                   frequency);
}

static void execute_rf_pll_disable_primitive(uint8_t accepted,
                                             uint8_t version,
                                             uint8_t *out_flags,
                                             uint8_t *out_status,
                                             uint32_t *out_state_before,
                                             uint32_t *out_pll_wait_loops,
                                             uint32_t *out_disable_wait_loops,
                                             uint32_t *out_state_after,
                                             uint32_t *out_token) {
  if (out_flags == NULL || out_status == NULL ||
      out_state_before == NULL || out_pll_wait_loops == NULL ||
      out_disable_wait_loops == NULL || out_state_after == NULL ||
      out_token == NULL) {
    return;
  }

  *out_flags = 0U;
  *out_status = VPR_RF_PRIMITIVE_STATUS_NOT_ACCEPTED;
  *out_state_before = read_radio_register(VPR_NRF_RADIO_STATE_OFFSET);
  *out_pll_wait_loops = 0U;
  *out_disable_wait_loops = 0U;
  *out_state_after = *out_state_before;
  *out_token = 0U;

  if (accepted == 0U) {
    return;
  }

  *out_flags = VPR_RF_PRIMITIVE_FLAG_VALID;
  if (*out_state_before != 0U) {
    *out_status = VPR_RF_PRIMITIVE_STATUS_RADIO_BUSY;
    *out_token = build_measurement_rf_primitive_token(
        version, *out_flags, *out_status, *out_state_before,
        *out_pll_wait_loops, *out_disable_wait_loops, *out_state_after);
    return;
  }

  const uint32_t current_mode = read_radio_register(VPR_NRF_RADIO_MODE_OFFSET);
  const uint32_t current_frequency =
      read_radio_register(VPR_NRF_RADIO_FREQUENCY_OFFSET);
  write_radio_register(VPR_NRF_RADIO_MODE_OFFSET, current_mode);
  write_radio_register(VPR_NRF_RADIO_FREQUENCY_OFFSET, current_frequency);
  write_radio_register(VPR_NRF_RADIO_EVENTS_PLLREADY_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_TASKS_PLLEN_OFFSET, 1U);

  while (read_radio_register(VPR_NRF_RADIO_EVENTS_PLLREADY_OFFSET) == 0U &&
         *out_pll_wait_loops < VPR_RF_PRIMITIVE_PLL_WAIT_MAX_LOOPS) {
    *out_pll_wait_loops = *out_pll_wait_loops + 1U;
  }

  if (read_radio_register(VPR_NRF_RADIO_EVENTS_PLLREADY_OFFSET) != 0U) {
    *out_flags |= VPR_RF_PRIMITIVE_FLAG_PLL_READY;
  }

  write_radio_register(VPR_NRF_RADIO_TASKS_DISABLE_OFFSET, 1U);
  while (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) == 0U &&
         *out_disable_wait_loops < VPR_RF_PRIMITIVE_DISABLE_WAIT_MAX_LOOPS) {
    *out_disable_wait_loops = *out_disable_wait_loops + 1U;
  }

  if (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) != 0U) {
    *out_flags |= VPR_RF_PRIMITIVE_FLAG_DISABLED;
  }

  *out_state_after = read_radio_register(VPR_NRF_RADIO_STATE_OFFSET);
  if ((*out_flags & VPR_RF_PRIMITIVE_FLAG_PLL_READY) == 0U) {
    *out_status = VPR_RF_PRIMITIVE_STATUS_PLL_TIMEOUT;
  } else if ((*out_flags & VPR_RF_PRIMITIVE_FLAG_DISABLED) == 0U ||
             *out_state_after != 0U) {
    *out_status = VPR_RF_PRIMITIVE_STATUS_DISABLE_TIMEOUT;
  } else {
    *out_status = VPR_RF_PRIMITIVE_STATUS_OK;
  }

  *out_token = build_measurement_rf_primitive_token(
      version, *out_flags, *out_status, *out_state_before,
      *out_pll_wait_loops, *out_disable_wait_loops, *out_state_after);
}

static void execute_rf_channel_retune_primitive(uint8_t accepted,
                                                uint8_t version,
                                                uint8_t channel,
                                                uint8_t *out_flags,
                                                uint8_t *out_status,
                                                uint32_t *out_target_frequency,
                                                uint32_t *out_target_datawhite,
                                                uint32_t *out_observed_frequency,
                                                uint32_t *out_observed_datawhite,
                                                uint32_t *out_token) {
  if (out_flags == NULL || out_status == NULL ||
      out_target_frequency == NULL || out_target_datawhite == NULL ||
      out_observed_frequency == NULL || out_observed_datawhite == NULL ||
      out_token == NULL) {
    return;
  }

  *out_flags = 0U;
  *out_status = VPR_RF_RETUNE_STATUS_NOT_ACCEPTED;
  *out_target_frequency = 0U;
  *out_target_datawhite = 0U;
  *out_observed_frequency = read_radio_register(VPR_NRF_RADIO_FREQUENCY_OFFSET);
  *out_observed_datawhite = read_radio_register(VPR_NRF_RADIO_DATAWHITE_OFFSET);
  *out_token = 0U;

  if (accepted == 0U) {
    return;
  }

  *out_flags = VPR_RF_RETUNE_FLAG_VALID;
  if (!vpr_valid_data_channel(channel)) {
    *out_status = VPR_RF_RETUNE_STATUS_INVALID_CHANNEL;
    *out_token = build_measurement_rf_retune_token(
        version, *out_flags, *out_status, channel, *out_target_frequency,
        *out_target_datawhite, *out_observed_frequency,
        *out_observed_datawhite);
    return;
  }

  if (read_radio_register(VPR_NRF_RADIO_STATE_OFFSET) != 0U) {
    *out_status = VPR_RF_RETUNE_STATUS_RADIO_BUSY;
    *out_target_frequency = vpr_ble_channel_frequency(channel);
    *out_target_datawhite = vpr_ble_datawhite_value(channel);
    *out_token = build_measurement_rf_retune_token(
        version, *out_flags, *out_status, channel, *out_target_frequency,
        *out_target_datawhite, *out_observed_frequency,
        *out_observed_datawhite);
    return;
  }

  *out_target_frequency = vpr_ble_channel_frequency(channel);
  *out_target_datawhite = vpr_ble_datawhite_value(channel);
  write_radio_register(VPR_NRF_RADIO_MODE_OFFSET, VPR_RADIO_MODE_BLE_2MBIT);
  *out_flags |= VPR_RF_RETUNE_FLAG_MODE_WRITTEN;
  write_radio_register(VPR_NRF_RADIO_FREQUENCY_OFFSET, *out_target_frequency);
  *out_flags |= VPR_RF_RETUNE_FLAG_FREQUENCY_WRITTEN;
  write_radio_register(VPR_NRF_RADIO_DATAWHITE_OFFSET, *out_target_datawhite);
  *out_flags |= VPR_RF_RETUNE_FLAG_DATAWHITE_WRITTEN;

