lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
  *out_observed_frequency = read_radio_register(VPR_NRF_RADIO_FREQUENCY_OFFSET);
  *out_observed_datawhite = read_radio_register(VPR_NRF_RADIO_DATAWHITE_OFFSET);
  *out_status =
      (*out_observed_frequency == *out_target_frequency &&
       *out_observed_datawhite == *out_target_datawhite)
          ? VPR_RF_RETUNE_STATUS_OK
          : VPR_RF_RETUNE_STATUS_VERIFY_FAILED;
  *out_token = build_measurement_rf_retune_token(
      version, *out_flags, *out_status, channel, *out_target_frequency,
      *out_target_datawhite, *out_observed_frequency,
      *out_observed_datawhite);
}

static uint32_t vpr_timed_mode2_wait_target(uint16_t wait_us,
                                            uint32_t max_loops) {
  uint32_t target = ((uint32_t)wait_us / VPR_RF_TIMED_MODE2_LOOP_SCALE_US) + 1U;
  return (target <= max_loops) ? target : max_loops;
}

static uint32_t build_measurement_rf_timed_mode2_token(
    uint8_t version,
    uint8_t flags,
    uint8_t status,
    uint8_t channel,
    uint8_t sequence,
    uint16_t control_to_probe_delay_us,
    uint16_t response_listen_window_us,
    uint32_t tx_wait_loops,
    uint32_t gap_wait_loops,
    uint32_t rxready_wait_loops,
    uint32_t listen_wait_loops,
    uint32_t disable_wait_loops,
    uint32_t state_after) {
  return 0xD2000000UL ^
         ((uint32_t)version) ^
         ((uint32_t)flags << 16U) ^
         ((uint32_t)status << 24U) ^
         ((uint32_t)channel << 8U) ^
         ((uint32_t)sequence << 20U) ^
         ((uint32_t)control_to_probe_delay_us << 3U) ^
         ((uint32_t)response_listen_window_us << 7U) ^
         tx_wait_loops ^
         (gap_wait_loops << 2U) ^
         (rxready_wait_loops << 4U) ^
         (listen_wait_loops << 5U);
}

static void execute_rf_timed_mode2_primitive(
    uint8_t accepted,
    uint8_t version,
    uint8_t channel,
    uint8_t packet_s0,
    uint8_t packet_cte_info,
    uint8_t packet_sequence,
    uint16_t control_to_probe_delay_us,
    uint16_t response_listen_window_us,
    uint8_t *out_flags,
    uint8_t *out_status,
    uint32_t *out_state_before,
    uint32_t *out_tx_wait_loops,
    uint32_t *out_gap_wait_loops,
    uint32_t *out_rxready_wait_loops,
    uint32_t *out_listen_wait_loops,
    uint32_t *out_disable_wait_loops,
    uint32_t *out_state_after,
    uint32_t *out_token) {
  if (out_flags == NULL || out_status == NULL ||
      out_state_before == NULL || out_tx_wait_loops == NULL ||
      out_gap_wait_loops == NULL || out_rxready_wait_loops == NULL ||
      out_listen_wait_loops == NULL || out_disable_wait_loops == NULL ||
      out_state_after == NULL || out_token == NULL) {
    return;
  }

  *out_flags = 0U;
  *out_status = VPR_RF_TIMED_MODE2_STATUS_NOT_ACCEPTED;
  *out_state_before = read_radio_register(VPR_NRF_RADIO_STATE_OFFSET);
  *out_tx_wait_loops = 0U;
  *out_gap_wait_loops = 0U;
  *out_rxready_wait_loops = 0U;
  *out_listen_wait_loops = 0U;
  *out_disable_wait_loops = 0U;
  *out_state_after = *out_state_before;
  *out_token = 0U;
  g_cs_last_timed_mode2_status = *out_status;
  g_cs_last_timed_mode2_channel = channel;
  g_cs_last_timed_mode2_observed_flags = 0U;
  g_cs_last_timed_mode2_packet_s0 = 0U;
  g_cs_last_timed_mode2_packet_len = 0U;
  g_cs_last_timed_mode2_packet_type = 0U;
  g_cs_last_timed_mode2_packet_sequence = 0U;
  g_cs_last_timed_mode2_packet_channel = 0xFFU;
  g_cs_last_timed_mode2_rssi_sample = 0U;
  g_cs_last_timed_mode2_crc_status = 0U;
  g_cs_last_timed_mode2_event_mask = 0U;
  g_cs_last_timed_mode2_token = 0U;

  if (accepted == 0U) {
    return;
  }

  *out_flags = VPR_RF_TIMED_MODE2_FLAG_VALID;
  if (!vpr_valid_data_channel(channel)) {
    *out_status = VPR_RF_TIMED_MODE2_STATUS_INVALID_CHANNEL;
    *out_token = build_measurement_rf_timed_mode2_token(
        version, *out_flags, *out_status, channel, packet_sequence,
        control_to_probe_delay_us, response_listen_window_us,
        *out_tx_wait_loops, *out_gap_wait_loops, *out_rxready_wait_loops,
        *out_listen_wait_loops, *out_disable_wait_loops, *out_state_after);
    g_cs_last_timed_mode2_status = *out_status;
    g_cs_last_timed_mode2_observed_flags = VPR_RF_TIMED_MODE2_OBS_VALID;
    g_cs_last_timed_mode2_token = *out_token;
    return;
  }
  if (*out_state_before != 0U) {
    *out_status = VPR_RF_TIMED_MODE2_STATUS_RADIO_BUSY;
    *out_token = build_measurement_rf_timed_mode2_token(
        version, *out_flags, *out_status, channel, packet_sequence,
        control_to_probe_delay_us, response_listen_window_us,
        *out_tx_wait_loops, *out_gap_wait_loops, *out_rxready_wait_loops,
        *out_listen_wait_loops, *out_disable_wait_loops, *out_state_after);
    g_cs_last_timed_mode2_status = *out_status;
    g_cs_last_timed_mode2_observed_flags = VPR_RF_TIMED_MODE2_OBS_VALID;
    g_cs_last_timed_mode2_token = *out_token;
    return;
  }

  const uint32_t previous_pcnf0 =
      read_radio_register(VPR_NRF_RADIO_PCNF0_OFFSET);
  const uint32_t previous_pcnf1 =
      read_radio_register(VPR_NRF_RADIO_PCNF1_OFFSET);
  const uint32_t previous_packet_ptr =
      read_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET);
  const uint32_t previous_shorts =
      read_radio_register(VPR_NRF_RADIO_SHORTS_OFFSET);
  const uint32_t packet_ptr = (uint32_t)(uintptr_t)g_vpr_cs_packet_buffer;

  g_vpr_cs_packet_buffer[0] = packet_s0;
  g_vpr_cs_packet_buffer[1] = VPR_CS_PACKET_PAYLOAD_LEN;
  g_vpr_cs_packet_buffer[2] = packet_cte_info;
  g_vpr_cs_packet_buffer[3] = VPR_CS_PACKET_MAGIC0;
  g_vpr_cs_packet_buffer[4] = VPR_CS_PACKET_MAGIC1;
  g_vpr_cs_packet_buffer[5] = VPR_CS_PACKET_TYPE_PROBE;
  g_vpr_cs_packet_buffer[6] = packet_sequence;
  g_vpr_cs_packet_buffer[7] = channel;
  g_vpr_cs_packet_buffer[8] = 0U;

  write_radio_register(VPR_NRF_RADIO_PCNF0_OFFSET,
                       VPR_RADIO_PACKET_PCNF0_DEFAULT);
  write_radio_register(VPR_NRF_RADIO_PCNF1_OFFSET,
                       VPR_RADIO_PACKET_PCNF1_DEFAULT);
  write_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET, packet_ptr);

  write_radio_register(VPR_NRF_RADIO_SHORTS_OFFSET,
                       VPR_NRF_RADIO_SHORTS_TXREADY_START_Msk |
                       VPR_NRF_RADIO_SHORTS_PHYEND_DISABLE_Msk);
  write_radio_register(VPR_NRF_RADIO_EVENTS_TXREADY_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_EVENTS_RXREADY_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_EVENTS_END_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_EVENTS_CRCOK_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_EVENTS_CRCERROR_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_TASKS_TXEN_OFFSET, 1U);
  while (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) == 0U &&
         *out_tx_wait_loops < VPR_RF_TIMED_MODE2_TX_WAIT_MAX_LOOPS) {
    *out_tx_wait_loops = *out_tx_wait_loops + 1U;
  }
  if (read_radio_register(VPR_NRF_RADIO_EVENTS_TXREADY_OFFSET) != 0U) {
    *out_flags |= VPR_RF_TIMED_MODE2_FLAG_TX_READY;
  }
  if (read_radio_register(VPR_NRF_RADIO_EVENTS_END_OFFSET) != 0U) {
    *out_flags |= VPR_RF_TIMED_MODE2_FLAG_TX_END;
  }

  if ((read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) == 0U) ||
      ((*out_flags & (VPR_RF_TIMED_MODE2_FLAG_TX_READY |
                      VPR_RF_TIMED_MODE2_FLAG_TX_END)) !=
       (VPR_RF_TIMED_MODE2_FLAG_TX_READY |
        VPR_RF_TIMED_MODE2_FLAG_TX_END))) {
    *out_status = VPR_RF_TIMED_MODE2_STATUS_TX_TIMEOUT;
  } else {
    const uint32_t gap_target = vpr_timed_mode2_wait_target(
        control_to_probe_delay_us, VPR_RF_TIMED_MODE2_GAP_WAIT_MAX_LOOPS);
    while (*out_gap_wait_loops < gap_target) {
      *out_gap_wait_loops = *out_gap_wait_loops + 1U;
    }
    *out_flags |= VPR_RF_TIMED_MODE2_FLAG_TIMING_APPLIED;

    write_radio_register(VPR_NRF_RADIO_SHORTS_OFFSET,
                         VPR_NRF_RADIO_SHORTS_RXREADY_START_Msk |
                         VPR_NRF_RADIO_SHORTS_PHYEND_DISABLE_Msk);
    write_radio_register(VPR_NRF_RADIO_EVENTS_RXREADY_OFFSET, 0U);
    write_radio_register(VPR_NRF_RADIO_EVENTS_END_OFFSET, 0U);
    write_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET, 0U);
    write_radio_register(VPR_NRF_RADIO_EVENTS_CRCOK_OFFSET, 0U);
    write_radio_register(VPR_NRF_RADIO_EVENTS_CRCERROR_OFFSET, 0U);
    write_radio_register(VPR_NRF_RADIO_TASKS_RXEN_OFFSET, 1U);
    while (read_radio_register(VPR_NRF_RADIO_EVENTS_RXREADY_OFFSET) == 0U &&
           *out_rxready_wait_loops <
               VPR_RF_TIMED_MODE2_RXREADY_WAIT_MAX_LOOPS) {
      *out_rxready_wait_loops = *out_rxready_wait_loops + 1U;
    }
    if (read_radio_register(VPR_NRF_RADIO_EVENTS_RXREADY_OFFSET) != 0U) {
      *out_flags |= VPR_RF_TIMED_MODE2_FLAG_RX_READY;
      const uint32_t listen_target = vpr_timed_mode2_wait_target(
          response_listen_window_us,
          VPR_RF_TIMED_MODE2_LISTEN_WAIT_MAX_LOOPS);
      while (*out_listen_wait_loops < listen_target &&
             read_radio_register(VPR_NRF_RADIO_EVENTS_END_OFFSET) == 0U) {
        *out_listen_wait_loops = *out_listen_wait_loops + 1U;
      }
      if (read_radio_register(VPR_NRF_RADIO_EVENTS_END_OFFSET) != 0U) {
        *out_flags |= VPR_RF_TIMED_MODE2_FLAG_RX_END;
      }
    } else {
      *out_status = VPR_RF_TIMED_MODE2_STATUS_RXREADY_TIMEOUT;
    }
  }

  write_radio_register(VPR_NRF_RADIO_TASKS_DISABLE_OFFSET, 1U);
  while (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) == 0U &&
         *out_disable_wait_loops <
             VPR_RF_TIMED_MODE2_DISABLE_WAIT_MAX_LOOPS) {
    *out_disable_wait_loops = *out_disable_wait_loops + 1U;
  }
  if (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) != 0U &&
      read_radio_register(VPR_NRF_RADIO_STATE_OFFSET) == 0U) {
    *out_flags |= VPR_RF_TIMED_MODE2_FLAG_DISABLED;
  } else if (*out_status == VPR_RF_TIMED_MODE2_STATUS_NOT_ACCEPTED) {
    *out_status = VPR_RF_TIMED_MODE2_STATUS_DISABLE_TIMEOUT;
  }

  write_radio_register(VPR_NRF_RADIO_SHORTS_OFFSET, previous_shorts);
  write_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET, previous_packet_ptr);
  if (read_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET) ==
      previous_packet_ptr) {
    *out_flags |= VPR_RF_TIMED_MODE2_FLAG_PACKETPTR_RESTORED;
  }
  write_radio_register(VPR_NRF_RADIO_PCNF0_OFFSET, previous_pcnf0);
  write_radio_register(VPR_NRF_RADIO_PCNF1_OFFSET, previous_pcnf1);

