lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
  *out_state_after = read_radio_register(VPR_NRF_RADIO_STATE_OFFSET);
  if (*out_status == VPR_RF_TIMED_MODE2_STATUS_NOT_ACCEPTED) {
    if (((*out_flags & (VPR_RF_TIMED_MODE2_FLAG_TX_READY |
                        VPR_RF_TIMED_MODE2_FLAG_TX_END |
                        VPR_RF_TIMED_MODE2_FLAG_RX_READY |
                        VPR_RF_TIMED_MODE2_FLAG_DISABLED)) ==
         (VPR_RF_TIMED_MODE2_FLAG_TX_READY |
          VPR_RF_TIMED_MODE2_FLAG_TX_END |
          VPR_RF_TIMED_MODE2_FLAG_RX_READY |
          VPR_RF_TIMED_MODE2_FLAG_DISABLED)) &&
        *out_state_after == 0U) {
      *out_status = VPR_RF_TIMED_MODE2_STATUS_OK;
    }
  }
  *out_token = build_measurement_rf_timed_mode2_token(
      version, *out_flags, *out_status, channel, packet_sequence,
      control_to_probe_delay_us, response_listen_window_us,
      *out_tx_wait_loops, *out_gap_wait_loops, *out_rxready_wait_loops,
      *out_listen_wait_loops, *out_disable_wait_loops, *out_state_after);

  const uint8_t rx_end_seen =
      ((*out_flags & VPR_RF_TIMED_MODE2_FLAG_RX_END) != 0U) ? 1U : 0U;
  const uint8_t crc_ok_seen =
      ((read_radio_register(VPR_NRF_RADIO_EVENTS_CRCOK_OFFSET) != 0U) ||
       ((read_radio_register(VPR_NRF_RADIO_CRCSTATUS_OFFSET) & 0x1UL) != 0U))
          ? 1U
          : 0U;
  const uint8_t crc_error_seen =
      (read_radio_register(VPR_NRF_RADIO_EVENTS_CRCERROR_OFFSET) != 0U) ? 1U : 0U;
  const uint8_t event_mask =
      (((*out_flags & VPR_RF_TIMED_MODE2_FLAG_RX_READY) != 0U) ? 0x01U : 0x00U) |
      (rx_end_seen ? 0x02U : 0x00U) |
      (crc_ok_seen ? 0x04U : 0x00U) |
      (crc_error_seen ? 0x08U : 0x00U);
  uint8_t observed_flags = VPR_RF_TIMED_MODE2_OBS_VALID;
  uint8_t observed_s0 = 0U;
  uint8_t observed_len = 0U;
  uint8_t observed_type = 0U;
  uint8_t observed_sequence = 0U;
  uint8_t observed_channel = 0xFFU;
  if (rx_end_seen != 0U) {
    observed_flags |= VPR_RF_TIMED_MODE2_OBS_RX_END;
    observed_s0 = g_vpr_cs_packet_buffer[0];
    observed_len = g_vpr_cs_packet_buffer[1];
    observed_type = g_vpr_cs_packet_buffer[5];
    observed_sequence = g_vpr_cs_packet_buffer[6];
    observed_channel = g_vpr_cs_packet_buffer[7];
    if (crc_ok_seen != 0U) {
      observed_flags |= VPR_RF_TIMED_MODE2_OBS_CRC_OK;
    }
    if (crc_error_seen != 0U) {
      observed_flags |= VPR_RF_TIMED_MODE2_OBS_CRC_ERROR;
    }
    if (observed_len <= VPR_RADIO_PACKET_MAX_PAYLOAD_DEFAULT) {
      observed_flags |= VPR_RF_TIMED_MODE2_OBS_HEADER_PRESENT;
    }
    if (g_vpr_cs_packet_buffer[3] == VPR_CS_PACKET_MAGIC0 &&
        g_vpr_cs_packet_buffer[4] == VPR_CS_PACKET_MAGIC1) {
      observed_flags |= VPR_RF_TIMED_MODE2_OBS_MAGIC_MATCH;
    }
    if (observed_type == VPR_CS_PACKET_TYPE_REPORT) {
      observed_flags |= VPR_RF_TIMED_MODE2_OBS_REPORT_TYPE;
    }
    if (observed_channel == channel) {
      observed_flags |= VPR_RF_TIMED_MODE2_OBS_CHANNEL_MATCH;
    }
  }
  g_cs_last_timed_mode2_status = *out_status;
  g_cs_last_timed_mode2_channel = channel;
  g_cs_last_timed_mode2_observed_flags = observed_flags;
  g_cs_last_timed_mode2_packet_s0 = observed_s0;
  g_cs_last_timed_mode2_packet_len = observed_len;
  g_cs_last_timed_mode2_packet_type = observed_type;
  g_cs_last_timed_mode2_packet_sequence = observed_sequence;
  g_cs_last_timed_mode2_packet_channel = observed_channel;
  g_cs_last_timed_mode2_rssi_sample =
      (uint8_t)(read_radio_register(VPR_NRF_RADIO_RSSISAMPLE_OFFSET) & 0x7FUL);
  g_cs_last_timed_mode2_crc_status =
      (uint8_t)(read_radio_register(VPR_NRF_RADIO_CRCSTATUS_OFFSET) & 0x01UL);
  g_cs_last_timed_mode2_event_mask = event_mask;
  g_cs_last_timed_mode2_token = *out_token;
}

static size_t build_vendor_ble_cs_measurement_execute_complete_payload(uint8_t *payload,
                                                                       size_t max_len) {
  if (payload == NULL || max_len < 201U) {
    g_vpr_transport->lastError = 0xF1U;
    return 0U;
  }

  uint8_t step_channels[6] = {0};
  const uint8_t active_subevent = g_cs_active_subevent_index;
  const uint8_t subevent_count = current_demo_subevent_count();
  const uint8_t total_steps = current_demo_total_step_count();
  const uint8_t phase_step_count = current_demo_step_count();
  const uint8_t subevent_start = current_demo_subevent_start_step(active_subevent);
  const uint8_t subevent_steps = current_demo_subevent_step_count(active_subevent);
  const uint8_t step_channel_count =
      fill_demo_channels_for_procedure(step_channels, phase_step_count);
  const uint8_t rf_descriptor_version = 1U;
  const uint8_t rf_descriptor_valid = 1U;
  const uint8_t rf_hardware_version = 1U;
  const uint8_t rf_primitive_version = 1U;
  const uint8_t rf_retune_version = 1U;
  const uint8_t rf_timed_mode2_version = 1U;
  uint8_t rf_hardware_flags = 0U;
  uint32_t rf_hardware_state = 0U;
  uint32_t rf_hardware_mode = 0U;
  uint32_t rf_hardware_frequency = 0U;
  uint32_t rf_hardware_token = 0U;
  uint8_t rf_primitive_flags = 0U;
  uint8_t rf_primitive_status = VPR_RF_PRIMITIVE_STATUS_NOT_ACCEPTED;
  uint32_t rf_primitive_state_before = 0U;
  uint32_t rf_primitive_pll_wait_loops = 0U;
  uint32_t rf_primitive_disable_wait_loops = 0U;
  uint32_t rf_primitive_state_after = 0U;
  uint32_t rf_primitive_token = 0U;
  uint8_t rf_retune_flags = 0U;
  uint8_t rf_retune_status = VPR_RF_RETUNE_STATUS_NOT_ACCEPTED;
  uint32_t rf_retune_target_frequency = 0U;
  uint32_t rf_retune_target_datawhite = 0U;
  uint32_t rf_retune_observed_frequency = 0U;
  uint32_t rf_retune_observed_datawhite = 0U;
  uint32_t rf_retune_token = 0U;
  uint32_t rf_packet_config_token = 0U;
  uint8_t rf_timed_mode2_flags = 0U;
  uint8_t rf_timed_mode2_status = VPR_RF_TIMED_MODE2_STATUS_NOT_ACCEPTED;
  uint32_t rf_timed_mode2_state_before = 0U;
  uint32_t rf_timed_mode2_tx_wait_loops = 0U;
  uint32_t rf_timed_mode2_gap_wait_loops = 0U;
  uint32_t rf_timed_mode2_rxready_wait_loops = 0U;
  uint32_t rf_timed_mode2_listen_wait_loops = 0U;
  uint32_t rf_timed_mode2_disable_wait_loops = 0U;
  uint32_t rf_timed_mode2_state_after = 0U;
  uint32_t rf_timed_mode2_token = 0U;
  const uint32_t rf_descriptor_token = build_measurement_rf_descriptor_token(
      g_cs_config_id, g_cs_procedure_counter, g_cs_session_conn_handle,
      active_subevent, subevent_count, total_steps, subevent_start,
      subevent_steps, step_channel_count, step_channels, g_cs_role,
      g_cs_cs_sync_phy, g_cs_tx_power_delta, g_cs_rtt_type,
      g_cs_min_subevent_len, g_cs_max_subevent_len,
      g_cs_measurement_execute_count + 1U);
  const uint8_t ready = (g_cs_session_open != 0U &&
                         g_cs_procedure_counter != 0U &&
                         g_cs_config_id != 0U &&
                         total_steps != 0U &&
                         subevent_count != 0U &&
                         subevent_steps != 0U &&
                         step_channel_count != 0U)
                            ? 1U
                            : 0U;
  uint8_t packet_s0 = 0xA5U;
  uint8_t packet_cte_info = 10U & 0x1FU;
  uint16_t control_to_probe_delay_us = 2400U;
  uint16_t response_listen_window_us = 12000U;
  uint8_t status = BLE_CS_HCI_STATUS_SUCCESS;
  if (g_host_transport->hostLen > 4U) {
    packet_s0 = g_host_transport->hostData[4];
  }
  if (g_host_transport->hostLen > 5U) {
    packet_cte_info = g_host_transport->hostData[5] & 0x1FU;
  }
  if (g_host_transport->hostLen > 9U && g_host_transport->hostData[3] >= 6U) {
    control_to_probe_delay_us = read_le16(&g_host_transport->hostData[6]);
    response_listen_window_us = read_le16(&g_host_transport->hostData[8]);
  }
  uint8_t accepted = 0U;
  if (status == BLE_CS_HCI_STATUS_SUCCESS && ready == 0U) {
    status = BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (status == BLE_CS_HCI_STATUS_SUCCESS) {
    accepted = 1U;
    g_cs_measurement_execute_count = g_cs_measurement_execute_count + 1U;
    g_cs_measurement_execute_last_channels = step_channel_count;
    g_cs_measurement_execute_last_token = build_measurement_execute_token(
        g_cs_config_id, g_cs_procedure_counter, g_cs_session_conn_handle,
        active_subevent, subevent_count, total_steps, subevent_start,
        subevent_steps, step_channel_count, step_channels,
        g_cs_measurement_execute_count);
    const uint8_t packet_channel =
        (step_channel_count != 0U) ? step_channels[0] : 0xFFU;
    clear_timed_mode2_result_observations();
    uint8_t executed_channel_count = 0U;
    uint8_t all_timed_channels_ok = 1U;
    const uint8_t timed_channel_limit =
        (step_channel_count < VPR_RF_TIMED_MODE2_RESULT_MAX)
            ? step_channel_count
            : VPR_RF_TIMED_MODE2_RESULT_MAX;
    for (uint8_t ch_index = 0U; ch_index < timed_channel_limit; ++ch_index) {
      uint8_t loop_retune_flags = 0U;
      uint8_t loop_retune_status = VPR_RF_RETUNE_STATUS_NOT_ACCEPTED;
      uint32_t loop_retune_target_frequency = 0U;
      uint32_t loop_retune_target_datawhite = 0U;
      uint32_t loop_retune_observed_frequency = 0U;
      uint32_t loop_retune_observed_datawhite = 0U;
      uint32_t loop_retune_token = 0U;
      uint8_t loop_timed_flags = 0U;
      uint8_t loop_timed_status = VPR_RF_TIMED_MODE2_STATUS_NOT_ACCEPTED;
      uint32_t loop_timed_state_before = 0U;
      uint32_t loop_timed_tx_wait_loops = 0U;
      uint32_t loop_timed_gap_wait_loops = 0U;
      uint32_t loop_timed_rxready_wait_loops = 0U;
      uint32_t loop_timed_listen_wait_loops = 0U;
      uint32_t loop_timed_disable_wait_loops = 0U;
      uint32_t loop_timed_state_after = 0U;
      uint32_t loop_timed_token = 0U;
      const uint8_t loop_channel = step_channels[ch_index];

      execute_rf_channel_retune_primitive(
          accepted, rf_retune_version, loop_channel,
          &loop_retune_flags, &loop_retune_status,
          &loop_retune_target_frequency, &loop_retune_target_datawhite,
          &loop_retune_observed_frequency, &loop_retune_observed_datawhite,
          &loop_retune_token);
      execute_rf_timed_mode2_primitive(
          accepted, rf_timed_mode2_version, loop_channel, packet_s0,
          packet_cte_info,
          (uint8_t)((g_cs_measurement_execute_count + ch_index) & 0xFFU),
          control_to_probe_delay_us, response_listen_window_us,
          &loop_timed_flags, &loop_timed_status,
          &loop_timed_state_before, &loop_timed_tx_wait_loops,
          &loop_timed_gap_wait_loops,
          &loop_timed_rxready_wait_loops,
          &loop_timed_listen_wait_loops,
          &loop_timed_disable_wait_loops, &loop_timed_state_after,
          &loop_timed_token);
      (void)store_timed_mode2_result_observation();
      if (loop_timed_status == VPR_RF_TIMED_MODE2_STATUS_OK &&
          loop_timed_token != 0U) {
        ++executed_channel_count;
      } else {
        all_timed_channels_ok = 0U;
      }

      if (ch_index == 0U) {
        rf_retune_flags = loop_retune_flags;
        rf_retune_status = loop_retune_status;
        rf_retune_target_frequency = loop_retune_target_frequency;
        rf_retune_target_datawhite = loop_retune_target_datawhite;
        rf_retune_observed_frequency = loop_retune_observed_frequency;
        rf_retune_observed_datawhite = loop_retune_observed_datawhite;
        rf_retune_token = loop_retune_token;
        rf_timed_mode2_flags = loop_timed_flags;
        rf_timed_mode2_status = loop_timed_status;
        rf_timed_mode2_state_before = loop_timed_state_before;
        rf_timed_mode2_tx_wait_loops = loop_timed_tx_wait_loops;
        rf_timed_mode2_gap_wait_loops = loop_timed_gap_wait_loops;
        rf_timed_mode2_rxready_wait_loops = loop_timed_rxready_wait_loops;
        rf_timed_mode2_listen_wait_loops = loop_timed_listen_wait_loops;
        rf_timed_mode2_disable_wait_loops = loop_timed_disable_wait_loops;
        rf_timed_mode2_state_after = loop_timed_state_after;
        rf_timed_mode2_token = loop_timed_token;
      }
    }
    (void)restore_timed_mode2_result_observation(0U);
    uint8_t packet_config_flags =
        VPR_RF_PACKET_CONFIG_FLAG_VALID |
        VPR_RF_PACKET_CONFIG_FLAG_PACKET_WRITTEN;
    if (vpr_valid_data_channel(packet_channel)) {
      packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_PACKETPTR_WRITTEN;
    }
    if ((rf_timed_mode2_flags & VPR_RF_TIMED_MODE2_FLAG_PACKETPTR_RESTORED) != 0U) {
      packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_PACKETPTR_RESTORED;
    }
    if ((rf_timed_mode2_flags & VPR_RF_TIMED_MODE2_FLAG_TX_READY) != 0U) {
      packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_TX_READY |
                             VPR_RF_PACKET_CONFIG_FLAG_TX_STARTED;
    }
    if ((rf_timed_mode2_flags & VPR_RF_TIMED_MODE2_FLAG_TX_END) != 0U) {
      packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_TX_END;
    }
    if ((rf_timed_mode2_flags & VPR_RF_TIMED_MODE2_FLAG_DISABLED) != 0U) {
      packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_TX_DISABLED;
    }
    rf_packet_config_token =
        VPR_RADIO_PACKET_PCNF0_DEFAULT ^
        (VPR_RADIO_PACKET_PCNF1_DEFAULT << 1U) ^
        ((uint32_t)packet_config_flags << 16U) ^
        ((uint32_t)control_to_probe_delay_us << 3U) ^
        ((uint32_t)response_listen_window_us << 7U) ^
        ((uint32_t)packet_s0 << 2U) ^
        ((uint32_t)VPR_CS_PACKET_PAYLOAD_LEN << 5U) ^
        ((uint32_t)packet_cte_info << 9U) ^
        ((uint32_t)VPR_CS_PACKET_MAGIC0 << 11U) ^
        ((uint32_t)VPR_CS_PACKET_MAGIC1 << 15U) ^
        ((uint32_t)VPR_CS_PACKET_TYPE_PROBE << 13U) ^
        ((uint32_t)(g_cs_measurement_execute_count & 0xFFU) << 17U) ^
        ((uint32_t)packet_channel << 21U) ^
        1U;
    rf_hardware_flags = 0x01U;
    read_rf_hardware_snapshot(rf_hardware_version, rf_hardware_flags,
                              &rf_hardware_state, &rf_hardware_mode,
                              &rf_hardware_frequency, &rf_hardware_token);
    execute_rf_pll_disable_primitive(
        accepted, rf_primitive_version, &rf_primitive_flags,
        &rf_primitive_status, &rf_primitive_state_before,
        &rf_primitive_pll_wait_loops, &rf_primitive_disable_wait_loops,
        &rf_primitive_state_after, &rf_primitive_token);
    if (rf_timed_mode2_status == VPR_RF_TIMED_MODE2_STATUS_OK &&
        all_timed_channels_ok != 0U &&
        executed_channel_count == step_channel_count &&
        g_pending_cs_result_stage == 0U) {
      g_pending_cs_result_stage = 1U;
      g_measurement_execute_result_active = 1U;
      g_cs_result_publish_debug_reason = 0U;
      g_cs_result_publish_debug_stage = 1U;
      g_cs_local_chunk_start_step = current_demo_subevent_start_step(active_subevent);
      g_cs_peer_chunk_start_step = current_demo_subevent_start_step(active_subevent);
      g_cs_next_chunk_stage_heartbeat = 0U;
      g_cs_next_peer_stage_heartbeat = 0U;
      g_cs_next_subevent_heartbeat = 0U;
    }
  } else {
    g_cs_measurement_execute_last_channels = 0U;
    g_cs_measurement_execute_last_token = 0U;
  }
  g_cs_measurement_execute_last_status = status;

  uint8_t flags = 0U;
  if (ready != 0U) {
    flags |= 0x01U;
  }
  if (accepted != 0U) {
    flags |= 0x02U;
  }
  if (g_pending_cs_result_stage != 0U) {
    flags |= 0x04U;
  }
  if (g_cs_peer_exchange_stage == VPR_CS_PEER_STAGE_PROCEDURE_ACTIVE ||
      g_measurement_execute_result_active != 0U) {
    flags |= 0x08U;
  }

